[
  {
    "title": "Apocalypse Now",
    "film_id": 1,
    "director": "Francis Ford Coppola",
    "year": 1979,
    "runtime": "03:13",
    "genre": ["War", "Horror", "Epic"],
    "writers": ["John Millud", "Francis Ford Coppola"],
    "cinematography": ["Vittorio Storaro"],
    "soundtrack": ["Carmine Coppola", "Francis Ford Coppola"],
    "notable_actors": [
      "Marlon Brando",
      "Martin Sheen",
      "Robert Duvall",
      "Laurence Fishburne",
      "Dennis Hopper",
      "Harrison Ford"
    ],
    "blurb": "A U.S. Army officer (Martin Sheen) serving in Vietname is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god (Marlon Brando).",
    "special_category": ["TOP 5"],
    "tags": [
      "francis",
      "ford",
      "coppola",
      "martin",
      "sheen",
      "marlon",
      "brando",
      "fishburne",
      "hopper",
      "harrison",
      "ford",
      "horror",
      "war",
      "apocalypse",
      "now",
      "1970",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/9l-ViOOFH-s",
    "trivia": [
      "Martin Sheen was actually drunk during the early hotel room scene where he actually cut his hand. He even reportedly tried to attack director Francis Ford Coppola",
      "A real water buffalo was slaughtered on set during the village ritual scene",
      "Dennis Hopper got a 14 year old Laurence Fishburne addicted to heroin on set during production",
      "Al Pacino was originally offerred the role of Willard but declined because he didn't want to spend months shooting in a swamp",
      "Coppola decided to frame Marlon Brando in shadow in many scenes to hide the extremely overweight actor",
      "Based on the 1899 novel 'Heart of Darkness' where a captain journeys through the Congo River, obsessed with an ivory trader, Kurtz",
      "While set during the Vietnam War, the film was actually shot in the Phillippines"
    ],
    "review_text": "Francis Ford Coppola’s 1979 epic war film ‘Apocalypse Now’ is one of the greatest movies I’ve seen. I personally rank it in my ‘top five films’ for a number of reasons.An adaptation of the 19th century novella ‘Heart of Darkness’ by Joseph Conrad, Coppola’s screenplay and adaptation is a mesmerising, surreal and terrifying exploration of the Vietnam War. From the very first scene, an unnerving sense of freedom from the fear of death fuels a sombre, desperate and tribal tone that resonates throughout the film as Martin Sheen’s Captain Willard journeys through Nung River in order to find and assassinate a rogue, PTSD inflicted and now morally destitute 'Colonel Kurtz’ (Marlon Brando), who has taken up a remote, isolated tribal island for himself as chief. The production of this film underwent troubles that’d make my alcohol-driven benders look unproblematic, most notably, the failing health and ego of Marlon Brando and Martin Sheen’s heart attack (as well as Dennis Hopper introducing a fourteen year old Laurence Fishburne to heroin).\nA large reason why I enjoy the film so much despite its dark subject matter is its’ candid, almost cinema verité style of direction, accompanied by the terrifying, psychedelic score pair for a horrifyingly surreal experience that exerts a tonne of emotional, political and philosophical depth. Coppola challenges the authority and philosophical ideologies held by Kurtz and juxtaposes them with Willard’s deeply flawed yet unjaded leadership. In a sense, Willard understands Kurtz descent into madness as he has similar experiences because of the Vietnam War, but has the awareness to and mental stability to understand why these ideologues are terrifying.\nMartin Sheen and Marlon Brando (despite his continued absence and reluctance to co-operate on set) seemed to tap into an extremely dark emotional place for their respective performances. Sheen’s particular insistence to actually be drunk during the beginning hotel scene seemed to be him working through some real life demons. Brando’s visible weight gain and Coppola’s subsequent decisions to mostly frame him away from light seeped into his traumatised, yet brutal performance as Kurtz. Dennis Hopper did so many drugs on set he was probably going through some shit too, I mean it certainly seemed like it onscreen.\nMy favourite scene in the film is when Willard’s team make their way to Do Lung Bridge where they find what appears to be hell on earth. Explosions echo and both friendly and enemy soldiers run madly firing their rifles in the dead of the night. All you see is explosions and all you hear is the wild, terrified screams of young American and Vietnamese men as they psychotically yell obscenities at each other through the gunfire.\nThis film can be emotionally taxing as its horror elements and mostly authentic depiction of the Vietnam War provide unsettling context to the characterisations, however I find this portrayal of men at the end of their ropes relenting to their inner darkness both despicable and fascinating. The art direction and anamorphic quality similar contribute to this harrowing film.",
    "review_score": 9.5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/01-apoc_now-thumb2.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/01-apoc_now/apoc-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/01-apoc_now/apoc-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/01-apoc_now/apoc-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/01-apoc_now/apoc-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/01-apoc_now/apoc-5.png"
    ],
    "headline": "I LOVE THE SMELL OF SWEATY BOAT MEN IN THE MORNING",
    "comments": []
  },
  {
    "title": "Uncut Gems",
    "film_id": 2,
    "director": "Safdie Brothers",
    "year": 2019,
    "runtime": "02:15",
    "genre": ["Drama", "Thriller"],
    "writers": ["Ronald Bronstein", "Josh Safdie", "Benny Safdie"],
    "cinematography": ["Darius Khondji"],
    "soundtrack": ["Daniel Lopatin"],
    "notable_actors": [
      "Adam Sandler",
      "Lakeith Stanfield",
      "Julia Fox",
      "Kevin Garnett",
      "Idina Menzel",
      "Eric Bogosian",
      "Abel Tesfaye"
    ],
    "blurb": "With his debts mounting and angry collectors closing in, a fast-talking New York City jeweller (Adam Sandler) risks everything in hope of staying afloat and alive.",
    "special_category": ["SUSPENSE", "ADAM SANDLER: CHARACTER ACTOR", "TOP 5"],
    "tags": [
      "uncut",
      "gems",
      "drama",
      "thriller",
      "safdie",
      "brothers",
      "josh",
      "ben",
      "lopatin",
      "adam",
      "sandler",
      "lakeith",
      "stanfield",
      "julia",
      "fox",
      "kevin",
      "garnett",
      "idina",
      "menzel",
      "weeknd",
      "abel",
      "2010"
    ],
    "trailer": "https://www.youtube.com/embed/vTfJp2Ts9X8",
    "trivia": [
      "Darius Khondji shot this movie in 35mm film on the Safdie brothers' insistence (they even took a pay cut for this)",
      "Inspired by the Safdie brothers' father's time working for a man called Howard in the Manhattan Diamond District",
      "Kevin Garnett's high profile in New York during 2012 led to him being cast as the NBA player with inconsistent performances",
      "Socialite Julia Fox's first role - who was cast due to her high profile among upper class New York City social groups",
      "Former NY Knick Amar'e Stoudemire was the first choice for Kevin Garnett's eventual role",
      "The Weeknd based his performance on the kind of arrogant guy he was at that stage of his life"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/02-uncut-thumb2.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/02-uncut_gems/uncut-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/02-uncut_gems/uncut-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/02-uncut_gems/uncut-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/02-uncut_gems/uncut-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/02-uncut_gems/uncut-5.jpg"
    ],
    "headline": "THRILLING CLASSIC IF YOU ENJOY VASECTOMIES",
    "comments": []
  },
  {
    "title": "Stalker",
    "film_id": 3,
    "director": "Andrei Tarkovsky",
    "year": 1979,
    "runtime": "02:41",
    "genre": ["Science Fiction", "Foreign Language", "Art"],
    "writers": ["Boris Strugatsky", "Arkady Strugatsky", "Andrei Tarkovsky"],
    "cinematography": ["Alexander Knyazhinsky"],
    "soundtrack": ["Eduard Artemyev"],
    "notable_actors": [
      "Alexander Kaidanovsky",
      "Anatoly Solonitsyn",
      "Nikolai Grinko",
      "Alisa Freindlich"
    ],
    "blurb": "A guide (Aleksandr Kaydanovskiy) leads two men (Nikolay Grinko & Anatoliy Solonitsyn) through an area known as the Zone to find a room that grants wishes.",
    "special_category": ["SOVIET", "PRETENTIOUS ART", "TOP 5"],
    "tags": [
      "stalker",
      "andrei",
      "tarkovsky",
      "sci-fi",
      "science fiction",
      "russian",
      "foreign",
      "surreal",
      "art",
      "soviet",
      "1970"
    ],
    "trailer": "https://www.youtube.com/embed/JCuwthnCRpg",
    "trivia": [
      "The 'Zone' was inspired by a nuclear incident in 1957 where several hundred square km were polluted by fallout",
      "The shooting location is said to be the cause of director Andrei Tarkovsky and lead actor Anatoly Solonitsyn (and his wife) due to chemical poisoning at the plant",
      "The film averages a new shot every 88 seconds (racist)",
      "In the film, a 'stalker' is one who guides tourists through the 'Zone'. In real life, stalkers are guides who shepherds tourists through the Chernobyl exclusion zone",
      "This film was released five years before the Chernobyl nuclear disaster",
      "Tarkovsky wanted to abandon work on the project multiple times",
      "In the final soundtrack, the boundaries between music and sound were blurred to the point of making them indistinguishable"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/03-stalker-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/03-stalker/stalker-1.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/03-stalker/stalker-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/03-stalker/stalker-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/03-stalker/stalker-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/03-stalker/stalker-5.jpg"
    ],
    "headline": "WATCH WHILE CONSUMING APPROX. 1.5L OF VODKA",
    "comments": []
  },
  {
    "title": "Brazil",
    "film_id": 4,
    "director": "Terry Gilliam",
    "year": 1985,
    "runtime": "02:23",
    "genre": ["Science Fiction", "Comedy", "Surreal"],
    "writers": ["Terry Gilliam", "Tom Stoppard", "Charles McKeown"],
    "cinematography": ["Roger Pratt"],
    "soundtrack": ["Michael Kamen"],
    "notable_actors": [
      "Robert De Niro",
      "Jonathan Pryce",
      "Kim Greist",
      "Katherine Helmond",
      "Jim Broadbent"
    ],
    "blurb": "A bureaucrat (Jonathan Pryce) in a dystopic society becomes an enemy of the state as he pursues the woman (Kim Greist) of his dreams.",
    "special_category": ["DE NIRO-SCORSESE CONNECTION", "DYSTOPIC SCI-FI"],
    "tags": [
      "brazil",
      "terry",
      "gilliam",
      "sci-fi",
      "science fiction",
      "comedy",
      "roger",
      "pratt",
      "robert",
      "de niro",
      "jonathan",
      "pryce",
      "jim",
      "broadbent",
      "surreal",
      "1980"
    ],
    "trailer": "https://www.youtube.com/embed/ZKPFC8DA9_8",
    "trivia": [
      "At first, De Niro's presence on set was exciting but over time, De Niro's need for research and obsession over details became irritating, with Gilliam saying he wanted to strangle him",
      "While most actors two or three takes, De Niro often needed 20-30 takes and still forgot lines",
      "While Gilliam had problems directing De Niro, Robert himself said he loved the experience and would work with Gilliam again",
      "Was originally to be titled 1984 1/2 after the Orwell novel and Fellini film - but after the film 1984 was released in 1984, this was scrapped",
      "Gilliam was reportedly unsatisfied with Kim Greist's perfomance and trimmed her scenes down in length",
      "Gilliam called this film the first in a dystopian satire trilogy, being followed by Twelve Monkeys (1995) and The Zero Theorem (2013)",
      "This film is popular with the American right wing, much to Terry Gilliam's surprise."
    ],
    "review_text": "Terry Gilliam’s 1985 science fiction film ‘Brazil’ is an entertaining dystopic sci-fi film that utilises a relatively unknown cast (with the exception of a mysterious character ‘Archibald Tuttle’ played by Robert De Niro) to depict a society that is overly reliant on underpowered and poorly constructed machines. The satire of bureaucracy, surveillance and state-capitalism on display in this film is intentionally exaggerated and absurd to the point of unbelievable.\nIt’s this absurdist take on dystopic sci-fi that creates a whimsical, hazy, fantasy inspired environment that often veers into surreal. I personally find the atmospheric qualities and world-building in this film to be its highlight and main appeal. I’ve always found dystopic societies intriguing in fiction, especially police-states that border on fascism. This is because I like to find little tid-bits in the real world that remind me of fascism in fiction so that I can point out how ‘DYSTOPIC’ society is and how close we are to ‘ULTIMATE COLLAPSE’ because of the right-wing maniacs (but mostly to make myself feel smug and superior over others).\nI also find the 1980s style costume, sets and lighting to be classic eighties Hollywood B-movie so that’s cool. Gilliam’s direction is good but nothing spectacular, although very stylized. In terms of narrative, it’s pretty standard and mediocre but I feel it could’ve been more interesting given the bizarre concept.",
    "review_score": 5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/04-brazil-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/04-brazil/brazil-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/04-brazil/brazil-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/04-brazil/brazil-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/04-brazil/brazil-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/04-brazil/brazil-5.jpg"
    ],
    "headline": "THIS HAS NOTHING TO DO WITH THE COUNTRY",
    "comments": []
  },
  {
    "title": "Pather Panchali",
    "film_id": 5,
    "director": "Satyajit Ray",
    "year": 1955,
    "runtime": "02:06",
    "genre": ["Epic", "Drama", "Foreign Language"],
    "writers": ["Satyajit Ray"],
    "cinematography": ["Subrata Mitra"],
    "soundtrack": ["Ravi Shankar"],
    "notable_actors": [
      "Subir Banerjee",
      "Kanu Banerjee",
      "Karuna Banerjee",
      "Uma Dasgupta",
      "Tulsi Chakraborty"
    ],
    "blurb": "Impoverished priest Harihar Ray (Kanu Banerjee), dreaming of a better life for himself and his family, leaves his rural Bengal village in search of work.",
    "special_category": ["INDIAN"],
    "tags": [
      "banerjee",
      "pather",
      "panchali",
      "satyajit",
      "ray",
      "1950",
      "epic",
      "drama",
      "thriller",
      "bengali",
      "indian",
      "foreign",
      "mitra",
      "shankar",
      "ravi",
      "subir",
      "kanu",
      "karuna",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/AdmTl8vNDUU",
    "trivia": [
      "Halfway through filming, Ray ran out of funds and the Government of West Bengal loaned him the funds to finish it",
      "The legend is when production started, Ray had never directed, camera-man Mitra had never photographed anyone and the child actors had never even been screentested",
      "The film never had a complete screenplay and the actors took direction from Ray's drawings and notes",
      "Translated title is: 'song of the little road'",
      "Ray was able to quit his job at an advertising agency after the international success of the film"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/05-pather-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/05-pather/pather-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/05-pather/pather-2.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/05-pather/pather-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/05-pather/pather-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/05-pather/pather-5.jpg"
    ],
    "headline": "THE MOTHER-MOTHERLAND",
    "comments": []
  },
  {
    "title": "Casino",
    "film_id": 6,
    "director": "Martin Scorsese",
    "year": 1995,
    "runtime": "02:58",
    "genre": ["Epic", "Crime", "Biographical"],
    "writers": ["Nicholas Pileggi", "Martin Scorsese"],
    "cinematography": ["Robert Richardson"],
    "soundtrack": ["Robbie Robertson"],
    "notable_actors": [
      "Robert De Niro",
      "Sharon Stone",
      "Joe Pesci",
      "James Woods",
      "Frank Vincent"
    ],
    "blurb": "A tale of greed, deception, money, power and murder occur between two best friends: a mafia enforcer (Joe Pesci) and a casino excecutive (Robert De Niro) compete against each other over a gambling empire; and over a fast-living and fast-loving socialite (Sharon Stone).",
    "special_category": ["DE NIRO-SCORSESE CONNECTION", "TOP 5"],
    "tags": [
      "casino",
      "martin",
      "scorsese",
      "epic",
      "crime",
      "1990",
      "nicholas",
      "pileggi",
      "richardson",
      "robert",
      "de niro",
      "sharon",
      "stone",
      "joe",
      "pesci",
      "james",
      "woods",
      "frank",
      "vincent"
    ],
    "trailer": "https://www.youtube.com/embed/EJXDMwGWhoA",
    "trivia": [
      "Most of the dialogue between De Niro and Pesci was improvised, Scorsese would tell them where to start and end - the rest was up to them",
      "Joe Pesci's striking resemblence to the real person his character is based on caused several pit bosses who worked with the original to faint upon seeing him first day of shoot",
      "Casino scenes were shot inside the Riviera between 1am - 4am to avoid interrupting normal business",
      "Sharon Stone encouraged her child actor daughter to annoy James Woods constantly",
      "The producers said the hardest thing of making the film was finding people who'd tell them how to cheat in a casino",
      "There are 453 f-words in the film, averaging 2.4 f-words per minute",
      "Martin Scorsese said in an interview that there's 'no plot - it's three hours, no plot'"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/06-casino-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/06-casino/casino-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/06-casino/casino-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/06-casino/casino-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/06-casino/casino-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/06-casino/casino-5.jpg"
    ],
    "headline": "I'M READY TO HIT SKYCITY",
    "comments": []
  },
  {
    "title": "Perfect Blue",
    "film_id": 7,
    "director": "Satoshi Kon",
    "year": 1997,
    "runtime": "01:21",
    "genre": ["Animated", "Psychological", "Thriller", "Foreign Language"],
    "writers": ["Sadayuki Murai"],
    "cinematography": ["Hisao Shirai"],
    "soundtrack": ["Masahiro Ikumi"],
    "notable_actors": [
      "Ruby Marlowe",
      "Wendee Lee",
      "Gil Starberry",
      "Bob Marx",
      "Steve Bulen"
    ],
    "blurb": "A pop singer (Ruby Marlowe) gives up her career to become an actress, but she slowly goes insane when she starts being stalked by an obsessed fan (Bob Marx) and what seems to be a ghost of her past.",
    "special_category": ["JAPANESE ANIME"],
    "tags": [
      "perfect",
      "blue",
      "satoshi",
      "kon",
      "1990",
      "animated",
      "anime",
      "psych",
      "thriller",
      "foreign",
      "japan",
      "ruby",
      "marlowe",
      "wendee",
      "lee"
    ],
    "trailer": "https://www.youtube.com/embed/4uRakM7gpo4",
    "trivia": [
      "In the scene where Mima uses the internet - the browser she uses is Netscape Navigator",
      "Was originally conceived as a live-action film but became a lower budget anime when producers backed out",
      "The bath scene from 'Requiem for a Dream' was directly inspired by the bath scene in this film",
      "The film's original 35mm camera negative was accidentally destroyed and so all copies of this movie is sourced from lower quality prints"
    ],
    "review_text": "Satoshi Kon directs this animated psychological thriller from Japan. This is not a Studio Ghibli film. ‘Perfect Blue’ follows ‘Mima’, a member of a successful J-Pop group called ‘CHAM!’ Being a young, ambitious woman in Japan, she obviously eventually feels like leaving the group in order to increase her reputation and appeal to older, mature audiences. Becoming a full-time actress, she gains a stalker and associates of hers begin to show up murdered. Her journey through this experience and development as a person is the central focus of the film, as she begins to lose psychological control of reality.\nThe film highlights fandom and the obsessions that come out of it, as well as the role of young women in the Japanese entertainment industry. The film plays heavily on the male gaze – with plenty of nudity to express the female form as the subject of entertainment, both sexually and non-sexually. That being said, I feel the film falls into a similar trap as ‘Ghost in the Shell’ where female perspectives have been mostly curated and written by males; providing a less insightful exploration of Mima’s psyche. The themes of sexual exploitation within the entertainment industry might’ve been more impactful if more understood from a non-male perspective.\nThat said, this film is still an entertaining 80 minutes and as engaging as any psychological thriller I’ve seen.",
    "review_score": 6,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/07-pb-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/07-perfect_blue/pb-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/07-perfect_blue/pb-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/07-perfect_blue/pb-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/07-perfect_blue/pb-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/07-perfect_blue/pb-5.jpg"
    ],
    "headline": "WHEN POPSTARS LOSE IT",
    "comments": []
  },
  {
    "title": "Solaris",
    "film_id": 8,
    "director": "Andrei Tarkosvky",
    "year": 1972,
    "runtime": "02:46",
    "genre": ["Science Fiction", "Art", "Foreign Language"],
    "writers": ["Fridrikh Gorenshtein", "Andrei Tarkovsky"],
    "cinematography": ["Vadim Yusov"],
    "soundtrack": ["Eduard Artemyev"],
    "notable_actors": ["Donatas Banionis", "Natalya Bondarchuk", "Juri Jarvet"],
    "blurb": "A psychologist (Donatas Banionis) is sent to a station orbiting a distant planet in order to discover what has caused the crew to go insane.",
    "special_category": ["SOVIET", "PRETENTIOUS ART"],
    "tags": [
      "solaris",
      "andrei",
      "tarkovsky",
      "1970",
      "science fiction",
      "sci-fi",
      "art",
      "russian",
      "soviet",
      "space",
      "foreign",
      "donatas",
      "banionis",
      "natalya",
      "bondarchuk"
    ],
    "trailer": "https://www.youtube.com/embed/BBYJH6UAAfw",
    "trivia": [
      "Tarkovsky himself considers this film his least favourite",
      "Stanislaw Lem was scathing of the adaptation of his novel, and complained he did not write it about people's 'erotic problems in space'",
      "The extended scene following Berton as he rides back into the city was filmed in Osaka"
    ],
    "review_text": "The opening scenes of this film depict the natural and green landscapes of Earth as we take in a calming and introspective atmosphere. The beauty of the green brush strokes sporadically covered by a ghostly fog is the perfect way of introducing us to the protagonist, Kris Kelvin. If there’s anything to take from this nearly three-hour long feature, it’s how beautifully shot it is. Cinematographer Vadim Yusov encapsulates Tarkovsky’s vision through purposeful foreground and background framing and lengthy long-shots to accentuate the silence and thoughtful atmosphere.\nThis film if often compared to the innovative ‘2001: A Space Odyssey’ that was released three years earlier. While both films feature space-settings, eerie and surreal atmospheres and artistic composition, they diverge in plot and narrative structure. ‘2001’ is more literal in its expression of fear through artificial intelligence and its’ supposed sentience while ‘Solaris’ takes a horror-mystery approach.\nPsychologist Kris Kelvin is sent on an interstellar journey to study the oceanic planet ‘Solaris’. Odd events occur on the space-station, and this is the core of the story where Kelvin must attempt to decipher the cause of crew disappearances while fighting hallucinations of his late wife, Hari.\nThe plot is fairly slow moving and sentimental, with little action occurring throughout. However, this allows more time for audiences to explore the thematic stylings and atmospheric qualities. I’d watch this film again on a slow, reflective Sunday afternoon to distract myself from the feeling of impending doom. Nonetheless, Soviet art films have a way of depicting the unsettling despair of life to make you feel a lot more lucky.",
    "review_score": 6,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/08-solaris-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/08-solaris/solaris-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/08-solaris/solaris-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/08-solaris/solaris-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/08-solaris/solaris-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/08-solaris/solaris-5.jpg"
    ],
    "headline": "NO THIS IS NOT 2001",
    "comments": []
  },
  {
    "title": "Persona",
    "film_id": 9,
    "director": "Ingmar Bergman",
    "year": 1966,
    "runtime": "01:24",
    "genre": ["Psychological", "Drama", "Foreign Language"],
    "writers": ["Ingmar Bergman"],
    "cinematography": ["Sven Nykvist"],
    "soundtrack": ["Lars Johan Werle"],
    "notable_actors": ["Bibi Andersson", "Liv Ullman"],
    "blurb": "A nurse (Bibi Andersson) is put in charge of a mute actress (Liv Ullman) and finds that their personae are melding together.",
    "special_category": ["SWEDE"],
    "tags": [
      "persona",
      "1960",
      "ingmar",
      "bergman",
      "psych",
      "drama",
      "swedish",
      "foreign",
      "bibi",
      "andersson",
      "liv",
      "ulman",
      "lars",
      "sven",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/8ZO01M8k1mg",
    "trivia": [
      "Ingmar Bergman created the basic script while hospitalised for double pneumonia",
      "Bergman reportedly fell in love with Liv Ullman during the production of this film",
      "The character Alma's name means 'soul' in Spanish and Portuguese",
      "Consists of few wide shots but many long and intense close ups because Bergman felt mid-shots were too boring"
    ],
    "review_text": "Ingmar Bergman’s 1966 film ‘Persona’ opens with an unsettling montage intended to transport the viewer into a surreal and unnerving frame of mind. The experimental, black-and-white film is like nothing I’ve seen before (maybe I’m showing my age). The longing, meditative shots accentuate the therapeutic environment.\nThere’s a lot to be said about this film, from its’ themes of identity and sexuality that were certainly innovative for the 1960s, to its’ disjointed narrative structure. The insertion of real-world footage, such as the immolation of a Buddhist and lamb slaughter can provide frightening undertones to the concept of mental health and psychological deterioration. The film’s short 84 minute length allow enough space for the narrative to expand and detail it’s thematic punches with perfect execution.\nWhile elements of misogyny and sexual discrimination are heavily apparent (being a product of a white male in the 1960s), the depiction of the two women offer insight into the gender identities of an actress and a nurse from the time period.\nIn the end, the development of the relationship between the two women is intriguing to watch unfold as their identities seem to merge and become symbiotic. As one of Bergman’s most influential films (as well as ‘The Seventh Seal’), I can see the reason for its continued influence on world cinema – is pretty good movie mang.",
    "review_score": 7,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/09-persona-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/09-persona/persona-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/09-persona/persona-2.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/09-persona/persona-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/09-persona/persona-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/09-persona/persona-5.jpg"
    ],
    "headline": "SIGMUND FREUD SENDS HIS REGARDS",
    "comments": []
  },
  {
    "title": "L.A. Confidential",
    "film_id": 10,
    "director": "Curtis Hanson",
    "year": 1997,
    "runtime": "02:18",
    "genre": ["Neo-Noir", "Crime"],
    "writers": ["Brian Helgeland", "Curtis Hanson"],
    "cinematography": ["Dante Spinotti"],
    "soundtrack": ["Jerry Goldsmith"],
    "notable_actors": [
      "Russell Crowe",
      "Guy Pearce",
      "Kevin Spacey",
      "James Cromwell",
      "Kim Basinger",
      "Danny DeVito"
    ],
    "blurb": "As corruption grows in 1950s Los Angeles, three policemen - one strait-laced (Guy Pearce), one brutal (Russell Crowe), and one sleazy (Kevin Spacey - of course) - investigate a series of murders with their own brand of justice.",
    "special_category": ["NOIR", "KEVIN SPACEY IS A RAPIST"],
    "tags": [
      "la",
      "l.a.",
      "l.a",
      "confidential",
      "curtis",
      "hanson",
      "1990",
      "neo",
      "noir",
      "crime",
      "brian",
      "russell",
      "crowe",
      "guy",
      "pearce",
      "kevin",
      "spacey",
      "rapist",
      "james",
      "cromwell",
      "kim",
      "basinger",
      "danny",
      "devito"
    ],
    "trailer": "https://www.youtube.com/embed/-sMDRQe0oW8",
    "trivia": [
      "Hanson and Helgeland worked on the script together for two years",
      "Russell Crowe did not drink for the entire shoot because his character did not - he described this as the most painful period of his life",
      "Hanson did not want the film to look nostalgic and so chose more naturalistic lighting than traditional noir film",
      "Hanson cast Russell Crowe after seeing him in another film and finding him repulsive and scary, but captivating",
      "Kevin Spacey is a rapist",
      "The film has eighty speaking parts"
    ],
    "review_text": "When viewing Curtis Hanson’s 1997 detective-noir, you may notice these pigs take whatever means necessary to serve their notion of justice. You may also notice Kevin Spacey acting creepy, but what else is new?\nI didn’t much care for Russell Crowe’s “Bud White”. As the emotional centre of the film, he does a decent job as the severely damaged anti-misogynist but I feel he falls deep into cliché. That might be the point as the film serves almost as a caricature of 1950s Los Angeles (although how would I know, I was born a month after this movie released). While many of these characters fall into two-dimensional cliches, it’s possible this is part of the intended ‘nostalgic’ effect.\nThere’s a metric ton of time-period-appropriate racism and homophobia but an EGREGIOUS amount of misogyny. Kim Basinger’s “Lynn” is two-dimensional and could have been written with more motivation than stereotype. After quickly Wikipedia’ing the source novel’s author, I’m not sure if I’m surprised or confused but more importantly – the lesson I learnt is James Ellroy is one crazy dude. And you know what? I think I’m going to deduct the movie on account of this opinion. That’s right, this is cancel culture in action bitches, sue me (But also please don’t).",
    "review_score": 5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/10-la_conf-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/10-la_conf/la_conf-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/10-la_conf/la_conf-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/10-la_conf/la_conf-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/10-la_conf/la_conf-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/10-la_conf/la_conf-5.png"
    ],
    "headline": "GOOD OL' NOIR IF YOU ENJOY TIME-PERIOD APPROPRIATE MISOGYNY",
    "comments": []
  },
  {
    "title": "City of God",
    "film_id": 11,
    "director": "Fernando Meirelles & Katia Lund",
    "year": 2002,
    "runtime": "02:10",
    "genre": ["Crime", "Foreign Language", "Biographical"],
    "writers": ["Braulio Mantovani"],
    "cinematography": ["Cesar Charlone"],
    "soundtrack": ["Antonio Pinto", "Ed Cortes"],
    "notable_actors": [
      "Alexandre Rodrigues",
      "Leandro Firmino da Hora",
      "Jonathan Haagensen"
    ],
    "blurb": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer (Alexandre Rodrigues) and the other a kingpin (Leandro Firmino da Hora).",
    "special_category": ["BRAZILIAN", "GANG SHIT"],
    "tags": [
      "city",
      "of",
      "god",
      "fernando",
      "mierelles",
      "katia",
      "lund",
      "2000",
      "crime",
      "foreign",
      "brazil",
      "cesar",
      "alexandre",
      "rodrigues",
      "leandro",
      "cortes"
    ],
    "trailer": "https://www.youtube.com/embed/RfnGQetbX-U",
    "trivia": [
      "All the amateur actors were recruited from favelas in Rio de Janeiro",
      "The scene where the gang prays before the war was not scripted. A young boy who used to be in a real gang recommended they do this and the director instructed him to lead the prayers",
      "The director was quoted as saying that if he knew the dangers of filming the movie in a Rio favela, he wouldn't have made the movie",
      "An acting coach told one of the child actors to bully the others to increase tension between the characters and one victim's annoyed and angry response is recorded and kept on the film"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/11-cog-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/11-cog/cog-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/11-cog/cog-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/11-cog/cog-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/11-cog/cog-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/11-cog/cog-5.jpg"
    ],
    "headline": "LIL KIDS DO GANG SHIT IDK MAN",
    "comments": []
  },
  {
    "title": "Punch-Drunk Love",
    "film_id": 12,
    "director": "Paul Thomas Anderson",
    "year": 2003,
    "runtime": "01:35",
    "genre": ["Comedy", "Drama"],
    "writers": ["Paul Thomas Anderson"],
    "cinematography": ["Robert Elswit"],
    "soundtrack": ["Jon Brion"],
    "notable_actors": [
      "Adam Sandler",
      "Emily Watson",
      "Phillip Seymour Hoffman",
      "Mary Lynn Rajskub",
      "Luis Guzman"
    ],
    "blurb": "A frustrated Barry Egan (Adam Sandler) calls a phone-sex line to curb his loneliness. Little does he know that he will land in huge trouble and will also jeopardise his relationship with Lena (Emily Watson).",
    "special_category": ["ADAM SANDLER: CHARACTER ACTOR"],
    "tags": [
      "punch",
      "drunk",
      "love",
      "2000",
      "paul",
      "thomas",
      "anderson",
      "comedy",
      "drama",
      "robert",
      "jon",
      "brion",
      "adam",
      "sandler",
      "emily",
      "watson",
      "phillip",
      "seymour",
      "hoffman",
      "mary",
      "lynn",
      "rajskub",
      "luis",
      "guzman"
    ],
    "trailer": "https://www.youtube.com/embed/Nqv_gYTVSUo",
    "trivia": [
      "The first Adam Sandler film to receive a positive review by film review legend Roger Ebert",
      "A fake commercial for the mattress store was shot but not kept in the film - it appears in the deleted scenes",
      "When Barry says 'business is very food', it was a typo in the script but it was kept in",
      "Even when writing the script, Paul Thomas Anderson wanted the score to heavily feature the harmonium",
      "As the film was entering production, composer Jon Brion and Mary Lynn Rasjskub's relationship ended, meaning he was forced to watch and score his ex-girlfriend's performances for months"
    ],
    "review_text": "Paul Thomas Anderson’s 2002 romantic-comedy ‘Punch-Drunk Love’ is a pivot from the usual pretentious art films I’ve listed thus far. Adam Sandler’s performance shows his range in dramatic roles as his socially awkward ‘Barry’ attempts to find love in Emily Watson’s ‘Lena’.\nUnfortunately, Barry has a perverted mishap with a scam phone-sex line and so obviously, hilarity ensues as he attempts to hide this from his romantic interest. Kiefer Sutherland’s personal hacker-man, “Chloe” from ‘24’ makes an appearance as Barry’s sister who likes to violently push him into social situations.\nAnderson’s direction is excellent as the fluid camera movements create a frantic, anxious pace that provides the film with both a sense of rhythm and claustrophobia. In this sense, Anderson perfectly executes the creation of ‘atmosphere’ and immersion.\nThe ensemble cast all perform beyond their best and deliver dialogue with a vivid feel of chemistry. The narrative flow and dialogue make the hour and a half runtime pass by in an instant. While the narrative starts out strong, I personally feel it fizzles out towards the end and improvements could have been made in this department.\nHowever, all things considered, this is one of my favourite films in the list because of its artistic use of colour, framing, blocking, dialogue and deadpan humour. An excellent Sandler classic, bruh. ",
    "review_score": 8,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/12-pdl-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/12-pdl/pdl-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/12-pdl/pdl-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/12-pdl/pdl-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/12-pdl/pdl-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/12-pdl/pdl-5.jpeg"
    ],
    "headline": "A REALISTIC DEPICTION OF MY THIRTIES IF I HADN'T FOUND GOOD RED WINE",
    "comments": []
  },
  {
    "title": "Mulholland Drive",
    "film_id": 13,
    "director": "David Lynch",
    "year": 2001,
    "runtime": "02:26",
    "genre": ["Neo-Noir", "Mystery", "Surreal"],
    "writers": ["David Lynch"],
    "cinematography": ["Peter Deming"],
    "soundtrack": ["Angelo Badalamenti"],
    "notable_actors": [
      "Justin Theroux",
      "Naomi Watts",
      "Laura Elena Herring",
      "Ann Miller",
      "Robert Forster"
    ],
    "blurb": "After a car wreck on the winding Mulholland Drive renders a woman (Laura Elena Herring) amnesiac, she and a perky Hollywood-hopeful (Naomi Watts) search for clues and answers across Los Angeles in a twisting venture beyond dreams and reality.",
    "special_category": ["LYNCHIAN"],
    "tags": [
      "mulholland",
      "drive",
      "dr",
      "david",
      "lynch",
      "2000",
      "neo",
      "noir",
      "mystery",
      "peter",
      "angelo",
      "badalamenti",
      "justin",
      "theroux",
      "naomi",
      "watts",
      "laura",
      "elena",
      "herring",
      "ann",
      "miller",
      "robert",
      "forster",
      "tyla",
      "surreal",
      "nonsense"
    ],
    "trailer": "https://www.youtube.com/embed/U-Y70mhkiJo",
    "trivia": [
      "Naomi Watts had lost her health insurance and faced eviction after this film wrapped, before close friend Nicole Kidman convinced her to stay until release",
      "On the way to her audition, Laura Harring was injured in a minor car crash",
      "David Lynch originally wrote the basic idea for this story in the early 1990s as a spin-off of Twin Peaks",
      "The phrase: 'This is the girl!' is said four times in this film",
      "Lynch said this film is a poisonous letter to Hollywood",
      "Monty Montgomery - who plays the Cowboy - couldn't remember his lines so Justin Theroux held up boards with his lines up for him",
      "ABC executives rejected the original pilot for Mulholland Drive because they deemed Naomi Watts and Laura Harring as too old to be television stars"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/13-mul-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/13-mulholland/mul-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/13-mulholland/mul-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/13-mulholland/mul-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/13-mulholland/mul-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/13-mulholland/mul-5.png"
    ],
    "headline": "FUCK YOU DAVID LYNCH",
    "comments": []
  },
  {
    "title": "The Irishman",
    "film_id": 14,
    "director": "Martin Scorsese",
    "year": 2019,
    "runtime": "03:29",
    "genre": ["Epic", "Crime", "Biographical"],
    "writers": ["Steven Zaillian"],
    "cinematography": ["Rodrigo Prieto"],
    "soundtrack": ["Robbie Robertson"],
    "notable_actors": [
      "Robert De Niro",
      "Al Pacino",
      "Joe Pesci",
      "Ray Romano",
      "Bobby Cannavale",
      "Anna Paquin",
      "Harvey Keitel"
    ],
    "blurb": "Hitman Frank Sheeran (Robert De Niro) looks back at the secrets he kept as a loyal member of the Bufalino crime family.",
    "special_category": ["DE NIRO-SCORSESE CONNECTION"],
    "tags": [
      "the",
      "irishman",
      "martin",
      "scorsese",
      "2010",
      "long",
      "epic",
      "crime",
      "steven",
      "zaillian",
      "rodrigo",
      "prieto",
      "robbie",
      "robertson",
      "robert",
      "de niro",
      "al",
      "pacino",
      "scarface",
      "joe",
      "pesci",
      "ray",
      "romano",
      "bobby",
      "cannavale",
      "anna",
      "paquin",
      "harvey",
      "keitel"
    ],
    "trailer": "https://www.youtube.com/embed/WHXxVmeGQUc",
    "trivia": [
      "Joe Pesci reportedly refused the role of Russell Bufalino over fifty times because he was in retirement before accepting",
      "Scorsese said he couldn't get a Hollywood studio to back a De Niro/Scorsese film anymore - so it was funded by Netflix",
      "This marks the first ever collaboration between Martin Scorsese and Al Pacino",
      "The longest film ever made by Martin Scorsese at 3 hours 30 minutes",
      "To de-age the actors (most playing characters thirty-fourty years their junior), digital CGI was used instead of make-up",
      "Both Liam Neeson and Pierce Brosnan were considered back-ups in case Robert De Niro was unable to make the film",
      "Shot primarily in 35mm film"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/14-irish-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/14-irishman/irish-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/14-irishman/irish-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/14-irishman/irish-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/14-irishman/irish-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/14-irishman/irish-5.jpg"
    ],
    "headline": "CLASSIC GANGSTER FILM; THE PERFECT SCORSESE-DE NIRO OUTRO",
    "comments": []
  },
  {
    "title": "Lawrence of Arabia",
    "film_id": 15,
    "director": "David Lean",
    "year": 1962,
    "runtime": "03:47",
    "genre": ["Epic", "Drama", "War", "Biographical"],
    "writers": ["Robert Bolt", "Michael Wilson"],
    "cinematography": ["Freddie A. Young"],
    "soundtrack": ["Maurice Jarre"],
    "notable_actors": [
      "Peter O'Toole",
      "Alec Guiness",
      "Anthony Quinn",
      "Jack Hawkins",
      "Omar Sharif"
    ],
    "blurb": "The story of T.E. Lawrence (Peter O'Toole), the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.",
    "special_category": ["WHITE MAN SAVIOUR"],
    "tags": [
      "lawrence",
      "of",
      "arabia",
      "1960",
      "epic",
      "drama",
      "war",
      "robert",
      "bolt",
      "michael",
      "wilson",
      "peter",
      "o'toole",
      "freddie",
      "young",
      "maurice",
      "alec",
      "guiness",
      "anthony",
      "quinn",
      "jack",
      "hawkins",
      "omar",
      "sharif",
      "long",
      "world",
      "ww2",
      "wwii",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/a3tuBFHuYV4",
    "trivia": [
      "This movie was banned in many Arab countries as they felt historical Arab figures were misrepresented",
      "On the first location scouting trip in Jordan, director David Lean discovered the remains of the Turkish locomotives Lawrence had destroyed during the Arab revolution",
      "Almost all movement in the movie goes from left to right",
      "Although 3 hours and 36 minutes long, the film features no women in speaking roles",
      "Soldiers of the Moroccan Army were employed as extras without pay, which caused resentment. They took potshots at the cast and crew after hours",
      "Night scenes were filmed during the day with light filters on the lenses because filming at night was not possible",
      "The first time Peter O'Toole rode a camel, blood oozed from his jeans"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/15-loa-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/15-lawrence/loa-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/15-lawrence/loa-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/15-lawrence/loa-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/15-lawrence/loa-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/15-lawrence/loa-5.jpg"
    ],
    "headline": "WHITE MAN SAVES EGYPT",
    "comments": []
  },
  {
    "title": "Three Colours: Red",
    "film_id": 16,
    "director": "Krzystof Kieslowski",
    "year": 1994,
    "runtime": "01:39",
    "genre": ["Romance", "Mystery", "Foreign Language"],
    "writers": ["Krzysztof Kieslowski", "Krzysztof Piesiewicz"],
    "cinematography": ["Piore Sobocinski"],
    "soundtrack": ["Zbiginiew Preisner"],
    "notable_actors": [
      "Irene Jacob",
      "Jean-Louis Trintignant",
      "Jean-Pierre Lorit"
    ],
    "blurb": "A model (Irene Jacob) discovers a retired judge (Jean-Louis Trintignant) is keen on invading people's privacy.",
    "special_category": ["PRETENTIOUS ART"],
    "tags": [
      "three",
      "colours",
      "red",
      "1990",
      "romance",
      "mystery",
      "foreign",
      "french",
      "france",
      "krzysztof",
      "kieslowski",
      "irene",
      "jacob",
      "jean-louis",
      "jean-pierre"
    ],
    "trailer": "https://www.youtube.com/embed/h8NU3EYTbFg",
    "trivia": [
      "Kieslowski asked Irene Jacob if she ever wished for a different name as a child to which she replied - Valentine - which is her character's name in this film",
      "Kieslowski retired after making this film (which is considered to be his greatest)",
      "Quentin Tarantino attempted to recruit Irene Jacob for Pulp Fiction but she turned it down to star in this film",
      "All three entries in the trilogy feature an elderly person trying to recycle empty bottles"
    ],
    "review_text": "I’d recently watched this film and found it intriguing as a concept, hence my decision to add it to the blog. French cinema has never appealed to me, however I’ve found director Krzysztof Kieslowski’s works appealing the past. I’ve seen a mini-series from 1989 called ‘Dekalog’ by Kieslowski and found it bold in its interpretation and depiction of the ten commandments. While I found it fairly hyperbolic, the series demonstrated the intriguing mental state and attitude of Polish culture. This Soviet nihilism reliant on character relationships and storytelling through dialogue – sprinkled with humble humour made his perspective on direction interesting enough for me to add his most critically acclaimed film to my list. This is obviously – “Three Colors: Red”.\nThe final in a trilogy titled ‘Blue’, ‘White’ and ‘Red’ (after the French flag - which the film borrows French Revolution themes from), ‘Three Colors: Red’ follows Irene Jacob’s ‘Valentine’ as she studies and works as a part-time model in Geneva. Running over a dog in the street, she locates the owner and finds that he is spying on his neighbours – who happen to be extremely wealthy and influential. His status as former detective and Valentine’s growing maturity make for a platonic relationship that is multi-dimensional in emotional depth and eventually symbiotic (to an extent).\nAt times, the film can be a bit too ‘on-the-nose’ in executing its thematic elements (the golden rule is to ‘show and not tell after all’, however much of this is necessary exposition and context. I’m just saying, maybe he could have been a little more subtle about it but what do I know – I’m not one of the worlds’ most admired cinematic marvels.\nOne of the most interesting themes of this film is how everyone is ‘interconnected’ in that every person has the ability to be intwined with another person’s life so easily, and often at unprecedented coincidence. Our personal experiences, actions and lifestyles have the ability to affect others without notice and within and instance – especially on a planet where you can send a picture of your genitals halfway across the world and receive a disgusted emoji reply within the span of several seconds. \nWhile this film’s general tone and narrative structure were personally insignificant (I couldn’t give a fuck less about French people problems) I can still greatly appreciate the character development through Valentine’s various personal connections and (at times) difficult experiences (such as having to reject the sexual advances of a creepy photographer colleague). The red highlights and overall warm colour palette create an exotic, yet realistic and engaging atmosphere that perfectly accentuate the narrative development. I feel Kieslowski deserves all the praise for his direction for this film and cannot discount it’s artistic and cinematic merit, regardless of how much of a shit I give about its’ narrative elements.",
    "review_score": 5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/16-tcr-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/16-tcr/tcr-1.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/16-tcr/tcr-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/16-tcr/tcr-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/16-tcr/tcr-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/16-tcr/tcr-5.jpg"
    ],
    "headline": "PRETENTIOUS FRENCH CINEMA IS JUST A'IGHT",
    "comments": []
  },
  {
    "title": "Ghost in the Shell",
    "film_id": 17,
    "director": "Mamoru Oshii",
    "year": 1995,
    "runtime": "01:22",
    "genre": ["Animated", "Neo-Noir", "Thriller", "Science Fiction"],
    "writers": ["Kazunori Ito"],
    "cinematography": ["Hisao Shirai"],
    "soundtrack": ["Kenji Kawai"],
    "notable_actors": ["Mimi Woods", "Richard Epcar", "Tom Wyner"],
    "blurb": "A cyborg policewoman (Mimi Woods) and her partner (Richard Epcar) hunt a mysterious and powerful hacker called the Puppet Master (Tom Wyner)",
    "special_category": ["JAPANESE ANIME"],
    "tags": [
      "ghost",
      "in",
      "the",
      "shell",
      "animated",
      "anime",
      "1990",
      "neo",
      "noir",
      "thriller",
      "crime",
      "cyberpunk",
      "mimi",
      "woods",
      "richard",
      "tom",
      "kazunori",
      "ito",
      "hisao",
      "shirai"
    ],
    "trailer": "https://www.youtube.com/embed/2uMNtOQOaLU",
    "trivia": [
      "In ordinary anime, characters blink to create the feeling of being animated but Motoko's eyes are intentionally static in this film to appear doll-like",
      "Inspired many action sequences in The Matrix",
      "Enjoys a better reputation outside of Japan than within it",
      "The film takes place in 2029",
      "In the scene where Section 6 retrieves Project 2501, the programming language on the computer is C"
    ],
    "review_text": "They really decided to mix the gunshot sounds extremely loud in this film huh?\n‘Ghost in the Shell’ is a certified cyberpunk classic, based on a Japanese manga of the same name.\nI’ll be honest, I found this film to be painfully below average and boring. While the cyber concepts are intriguing, I feel they are underdeveloped and lacking depth. The dialogue veers far too much into exposition, limiting the amount of genuine conversation over the interesting themes the film brings up. Mimi Woods’ stilted and awkward performance as the cyborg Major Kusanagi is however, excellent. She perfectly portrays the Major as a voided, justice-bent moral cyborg.\nWhile I enjoyed the nostalgia of old-school Japanese animation, the lower framerate as well as jagged animation felt slightly cheap for a feature-length film. Even older films like ‘Akira’ have more fluid and grand animation.\nWhile I understand the film’s intention to develop themes of gender and sexuality through Kusanagi’s appearance in a world where reproduction is non-sexual and mechanical, I still found Kusanagi’s voluptuous figure extreme and formed towards the male-gaze. I don’t understand why her breasts and hips have to be exaggerated with skin-tight clothing when I feel the same point could have been made with a less outrageously-bodacious cyborg.\nI don’t mean to say I’m a prude, I just feel it becomes crystal clear this film was made by men when every close-up of Kusanagi focuses on her figure and every other scene features gunshots louder than my pained squeals when I urinate every morning.\nI don’t know man this movie kind of sucked and that’s pretty disappointing, hence this short and HALF-ASSED review.",
    "review_score": 3,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/17-ghost-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/17-ghost/ghost-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/17-ghost/ghost-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/17-ghost/ghost-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/17-ghost/ghost-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/17-ghost/ghost-5.jpg"
    ],
    "headline": "DOWN BAD FOR KUSANAGI",
    "comments": []
  },
  {
    "title": "Children of Men",
    "film_id": 18,
    "director": "Alfonso Cuaron",
    "year": 2006,
    "runtime": "01:49",
    "genre": ["Science Fiction", "Action", "Thriller"],
    "writers": [
      "Alfonso Cuaron",
      "Timothy J. Sexton",
      "David Arata",
      "Mark Fergus",
      "Hawk Otsby"
    ],
    "cinematography": ["Emmanuel Lubezki"],
    "soundtrack": ["John Tavener"],
    "notable_actors": [
      "Clive Owen",
      "Julianne Moore",
      "Clare-Hope Ashitey",
      "Michael Caine",
      "Chiwetel Ejiofor",
      "Charlie Hunnman"
    ],
    "blurb": "In 2027, in a chaotic world in which women have become somehow infertile, a former activist (Clive Owen) agrees to transport a miraculously pregnant woman (Clare-Hope Ashitey) to a sanctuary at sea.",
    "special_category": ["DYSTOPIC SCI-FI"],
    "tags": [
      "children",
      "of",
      "men",
      "alfonso",
      "cuaron",
      "2000",
      "sci-fi",
      "science fiction",
      "action",
      "thriller",
      "clive",
      "owen",
      "julianne",
      "moore",
      "clare-hope",
      "ashitey",
      "michael",
      "caine",
      "chiwetel",
      "ejiofor",
      "charlie",
      "hunnman",
      "post-apocalyptic"
    ],
    "trailer": "https://www.youtube.com/embed/ZmC-1DMki_k",
    "trivia": [
      "The infertility crisis in this film is caused by all women being infertile while in the novel it's caused by men no longer producing sperm",
      "Almost every shot contains an animal - usually a dog",
      "Theo does not use or touch a gun at any point in the movie",
      "The movie never explains the reason for the infertility - likely due to Cuaron's dislike for exposition in film",
      "The opening terrorist attack in Fleet Street was filmed only two weeks after the real thing happened in London via Al-Qaeda terrorists",
      "In one of the minute-long cuts, blood splattered on the camera lens and days of work was almost ruined when Cuaron yelled cut - but this was overblown by the loud explosions in the background"
    ],
    "review_text": "The first thing about this film is that they call refugees ‘Fugees’ as if they’re some critically acclaimed hip hop group from the nineties. If you can get past that, the movie is immersive, captivating and anxiety-inducing.\nIf you’ve played the 2013 video game ‘The Last of Us’, the plot will feel familiar where an elder male who’s clearly ‘too old for this shit’ escorts a young lady thought to be the only hope in an apocalyptic world through a brutal, tribalist society.\nKee (Claire-Hope Ashitey) is a pregnant woman (formally a prostitute) in a world where a child has not been born in over 18 years. While the reason for this global infertility crisis is unexplained, the context is enough to build a fully-detailed and realistic world. The United Kingdom is the lone standing city and has become a police-state that detains and executes illegal immigrants / refugees fleeing other collapsed countries. The state of despair across the country is especially apparent when Theo and Kee transport throughout the country in search of a safe place for Kee to deliver and raise her baby. The poverty on display is reminiscent of the Balkan and Iraq wars of the late 20th to early 21st centuries. Innocent civilians are displaced and forced to shelter in high density blocks that are often the target of military strikes or raids due to ‘terrorist activity’.\nStylistically, Cuaron directs this film with perfect execution. His trademark long-tracking-shots allow a sense of tension and immersion to build in especially scary scenes. Cuaron and cinematographer Lubezki often paint the foreground with the ragged, tired demeanours of the core characters while pumping the background with exposition and an astounding amount of context. I especially love the use of long-tracking shots because I feel they tremendously add to the sense of fear and unsettling dread throughout the film; they’re peppered throughout and used a perfect amount.\nThe thematic references to the Holocaust where Nazi slogans are scrawled across brick walls and Abu Ghraib prison – featuring hooded prisoners being tortured and forced into inhumane conditions provide a grim undertone that fuels an intensely brutal and realistic depiction of a possible future. Cuaron’s decision to film this ‘cinema-verite’ (documentary style) expands this unsettling feeling whenever the group busses past a group of caged refugees or drives past a seemingly endless amount of zombie-like agitators. A particular scene on a bus towards the Bexhill-on-Sea prison camp is executed perfectly as the flow slowly depicts an escalating amount of inhumane practice upon prisoners. You begin to feel unsettled as your fears slowly become confirmed and realise you’re heading into an Auschwitz-Warsaw-Ghetto hybrid.\nI also felt like shouting ‘PICK UP A FUCKING GUN’ at Theo the entire film and was enthralled and anxious the entire latter half of the film – which felt like it flew by in a second.\nAside from a few stilted acting performances (I’m thinking the younger, slightly less experiences actors), this film is a CERTIFIED MUST WATCH.",
    "review_score": 8.5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/18-com-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/18_children_of_men/com-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/18_children_of_men/com-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/18_children_of_men/com-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/18_children_of_men/com-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/18_children_of_men/com-5.jpg"
    ],
    "headline": "MEN MAKE TERRIBLE PARENTS",
    "comments": []
  },
  {
    "title": "Oldboy",
    "film_id": 19,
    "director": "Park Chan-wook",
    "year": 2003,
    "runtime": "02:00",
    "genre": ["Neo-Noir", "Action", "Thriller", "Foreign Language"],
    "writers": [
      "Hwang Jo-yun",
      "Lim Jun-hyung",
      "Park Chan-wook",
      "Garon Tsuchiya",
      "Nobuaki Minegishi"
    ],
    "cinematography": ["Chung Chung-hoon"],
    "soundtrack": ["Cho Young-wuk"],
    "notable_actors": ["Choi Min-sik", "Yoo Ji-tae", "Kang Hye-jung"],
    "blurb": "After being kidnapped and imprisoned for fifteen years, Oh Dae-Su (Choi Min-sik) is released, only to find that he must find his captor in five days.",
    "special_category": ["DOPE KOREAN CINEMA"],
    "tags": [
      "oldboy",
      "park",
      "chan-wook",
      "korea",
      "2000",
      "neo",
      "noir",
      "action",
      "thriller",
      "foreign",
      "choi",
      "min-sik",
      "kang",
      "hye-jung"
    ],
    "trailer": "https://www.youtube.com/embed/2HkjrJ6IK5E",
    "trivia": [
      "Four live octopodes were eaten for the scene with Dae-Su in the sushi bar - a scene that provoked much controversy abroad",
      "When talking about sleeping gas used by Russian special forces, Oh Dae-Su refers to the 2002 Moscow hostage crisis",
      "Choi Min-sik is a Buddhist and had to pray after eating an octopus",
      "Yoo Ji-Tae had to learn yoga for this movie",
      "In the quiet scenes of the movie, the shots usually last about 10-15 seconds, in action scenes however, they usually last 2-6 seconds",
      "Based on Japanese manga 'Oldboy'"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/19-oldboy-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/19-oldboy/oldboy-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/19-oldboy/oldboy-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/19-oldboy/oldboy-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/19-oldboy/oldboy-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/19-oldboy/oldboy-5.jpg"
    ],
    "headline": "OLDBOY, MORE LIKE DEAD-INSIDE-BOY - HEHE",
    "comments": []
  },
  {
    "title": "American Beauty",
    "film_id": 20,
    "director": "Sam Mendes",
    "year": 1999,
    "runtime": "02:02",
    "genre": ["Drama", "Romance"],
    "writers": ["Alan Ball"],
    "cinematography": ["Conrad L. Hall"],
    "soundtrack": ["Thomas Newman"],
    "notable_actors": [
      "Kevin Spacey",
      "Thora Birch",
      "Mena Suvari",
      "Annette Bening",
      "Peter Gallagher",
      "Chris Cooper",
      "Allison Janney"
    ],
    "blurb": "A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend.",
    "special_category": ["KEVIN SPACEY IS A RAPIST"],
    "tags": [
      "american",
      "beauty",
      "sam",
      "mendes",
      "1990",
      "1999",
      "drama",
      "alan",
      "ball",
      "conrad",
      "hall",
      "thomas",
      "kevin",
      "spacey",
      "rapist",
      "thora",
      "birch",
      "allison",
      "janney",
      "chris",
      "cooper",
      "peter",
      "annette",
      "mena",
      "suvari"
    ],
    "trailer": "https://www.youtube.com/embed/OKpFcYNob7g",
    "trivia": [
      "Sam Mendes designed the girls' looks to change over the film, with Thora Birch gradually wearing less makeup and Mena Suvari, the opposite, to emphasize his view of their shifting self-pereceptions",
      "When Lester throws the asparagus, he was supposed to throw it on the floor, hence Annette Benning and Thora Birch's reactions are genuine",
      "Alan Ball was sitting at the World Trade Center plaza when he saw a paper bag floating in the wind and was inspired by it to write the film",
      "Originally conceived as a stage-play",
      "The scene where Lester attacks Carolyn's feet with the remote-controlled car was unscripted and Annette Benning's surprise and annoyance was genuine",
      "The hand and stomach on the film's poster do not belong to Mena Suvari, but are the hands of Christina Hendricks and stomach of Chloe Hunter",
      "Only Academy Award Best Picture winner in the 1990s aside from 'Silence of the Lambs' to not be a period-piece"
    ],
    "review_text": "Kevin Spacey is really good at portraying creepy characters, I wonder why that is? His Lester Burnham is a depressed, middle-aged man-child that seeks “excitement” and sexual thrill in an underaged friend of his daughters’. His life within American suburbia consists of an equally depressed wife and cliché teenaged daughter (struggling with the usual teenage girl issues). While seemingly having a functioning, typical suburban lifestyle, Lester’s contempt for his life seems to be self-inflicted as he wallows in self-victimhood and loathing. I found him deeply unlikeable due to his toxic attitude towards his family, creeping on his teenage daughters’ friend, taking his clearly overworked wife for granted and just overall – failing to appear as a stable role model and husband.\nWe’re never made aware of how he came to be this way, and are to assume that (as eloquently put by Thora Birchs’ Janie) he’s a complete loser. Throughout the course of the film, Lester begins to stop caring about anything – detaching from the rote, boring lifestyle of a working, suburban father. This is sparked by a desire to fuck his daughter’s underaged friend – as he works out, starts smoking cannabis (sourced by a neighbour’s son) and emphatically quits his white collar sales job for burger flipping.I feel that while Lester’s storyline as he becomes a less self-aware, yet positive and  more positive and secure with himself is the core line of the film, his tertiary and surrounding interactions and relationships with characters are the more telling and introspective as satire on late 1990s / early 2000s American suburbia. Lester’s lack of emotional intelligence when dealing with his wife and daughter are a scathing depiction of the role of men in a modern world. This is further explored with Ricky’s father and his own repressed homosexuality, as well as how this combination of the historical patriarchal framework and modern understanding of masculinity collides in destructive ways.\nAs a perspective on the dark underbelly of boring suburbia, I feel the film fantastically fills a clean, monotonous, yet visually striking atmosphere while using colourful cinematography (framing in particular) to accentuate critical themes of class and sexual repression. There’s a lot to be said about this film aside from the creepy (but realistic in many ways) relationship between Angela (Jane’s friend) and Lester. I haven’t written enough on Lester’s wife, Carolyn, or their daughter, as well as Allison Janney’s character because they’re all very interesting in their own ways – but there’s like thirty more films to watch.\n",
    "review_score": 6.5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/20-american_beauty-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/20-american_beauty/american_beauty-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/20-american_beauty/american_beauty-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/20-american_beauty/american_beauty-3.gif",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/20-american_beauty/american_beauty-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/20-american_beauty/american_beauty-5.png"
    ],
    "headline": "LOLITA FOR KEVIN SPACEY-ESQUE CREEPS",
    "comments": []
  },
  {
    "title": "Fear and Loathing in Las Vegas",
    "film_id": 21,
    "director": "Terry Gilliam",
    "year": 1998,
    "runtime": "01:58",
    "genre": ["Adventure", "Comedy", "Drama", "Surreal"],
    "writers": [
      "Hunter S. Thompson",
      "Terry Gilliam",
      "Tony Gtisoni",
      "Alex Cox",
      "Tod Davies"
    ],
    "cinematography": ["Nicola Pecorini"],
    "soundtrack": ["Ray Cooper"],
    "notable_actors": ["Johnny Depp", "Benicio del Toro", "Tobey Maguire"],
    "blurb": "An oddball journalist (Johnny Depp) and his psychopathic lawyer (Benecio del Toro) travel to Las Vegas for a series of psychedelic escapes.",
    "special_category": ["INEBRIATED", "TOP 5"],
    "tags": [
      "fear",
      "and",
      "loathing",
      "in",
      "las",
      "vegas",
      "adventure",
      "road",
      "desert",
      "nevada",
      "terry",
      "gilliam",
      "drugs",
      "surreal",
      "acid",
      "shrooms",
      "ketamine",
      "alcohol",
      "cocaine",
      "samoan",
      "lawyer",
      "hunter",
      "thompson",
      "nicola",
      "ray",
      "cooper",
      "pecorini",
      "johnny",
      "depp",
      "benicio",
      "del toro",
      "tobey",
      "maguire",
      "1990",
      "inebriated"
    ],
    "trailer": "https://www.youtube.com/embed/CiTllYeJc48",
    "trivia": [
      "Hunter S. Thompson shaved Johnny Depp's head. They were in Thompson's kitchen and Depp refused to look in a mirror",
      "Gilliam rewrote the entire screenplay after taking over from Alex Cox to fit his unique creative vision and style",
      "Much of the clothing worn by Johnny Depp in the movie were actual pieces of clothing the real Hunter S. Thompson wore in the 70s",
      "Martin Scorsese and Oliver Stone each tried to get this movie off the ground but were unsuccessful and moved on",
      "Gilliam wanted to provoke strong reactions to this film saying he wanted it to be seen as both the 'greatest' and 'most hated' film of all time",
      "Hunter S. Thompson developed a strong friendship with Johnny Depp and heartily approved of his performance",
      "Hunter S. Thompson said if he saw anyone acting the way Johnny Depp did in the film, he'd hit them with a chair"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/21-fear-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/21-fear_and_loathing/fear-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/21-fear_and_loathing/fear-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/21-fear_and_loathing/fear-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/21-fear_and_loathing/fear-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/21-fear_and_loathing/fear-5.png"
    ],
    "headline": "THIS MOVIE DIRECTLY LED TO NIXON'S WAR ON DRUGS",
    "comments": []
  },
  {
    "title": "Thief",
    "film_id": 22,
    "director": "Michael Mann",
    "year": 1981,
    "runtime": "02:02",
    "genre": ["Action", "Crime", "Drama"],
    "writers": ["Michael Mann"],
    "cinematography": ["Donald Thorin"],
    "soundtrack": ["Tangerine Dream"],
    "notable_actors": [
      "James Caan",
      "Tuesday Weld",
      "Robert Prosky",
      "Willie Nelson"
    ],
    "blurb": "An ace safe cracker wants to do one last big heist for the mob before going straight",
    "special_category": ["HEIST FILM"],
    "tags": [
      "thief",
      "michael",
      "mann",
      "1980",
      "action",
      "crime",
      "drama",
      "donald",
      "throin",
      "tangerine",
      "dream",
      "james",
      "caan",
      "tuesday",
      "weld",
      "willie"
    ],
    "trailer": "https://www.youtube.com/embed/SSPtl9uTtx4",
    "trivia": [
      "This is Robert Prosky's film debut - at 50 years old",
      "James Caan's favourite film of his own after 'The Godfather'",
      "In the hospital scene, Caan decided to stare coldly at the doctor (Jay Saunders), who was freaked out for real",
      "The burglary tools throughout the film are real and sourced from real burglars who served as consultants",
      "A 60,000 gallon water truck was used to keep the streets constantly wet",
      "Al Pacino turned down the role of Frank due to scheduling conflicts"
    ],
    "review_text": "Michael Mann’s feature film directorial debut is straight out of the 1980s. With a score provided by electronic / new age band ‘Tangerine Dream’, this heist film follows an ex-convict, Frank (James Caan) as he attempts to pull off one last job worth millions before quitting the game.\nPersonally, I found Frank inherently unlikeable despite his sympathetic backstory involving poverty, prison and survival. His experiences in prison lead him to an unfearful, resilient mentality that gave no regard for his personal wellbeing. It is through this mentality that Frank believed he survived the brutality and oppression of prison life. While this view is understandable, Frank seemingly appears to be unable to learn to evolve his views as the films progresses. His character does not change as he seems insistent on working his way; for himself and family only. This proves challenging as he soon has things to lose and insists on his lone-wolf, abrasive ways.\nI found myself actively rooting against Frank as he seemed a product of his times – a greedy, misogynistic and status-hungry white male with little self-awareness. His relationship with Jessie (Tuesday Weld) seems increasingly transactional and simply because having a wife and family are simply part of his life plan. The simplicity of his feelings portray a shallow and undeserving individual which reminds me of the aggressive behaviour of Tony Montana without the immigrant hunger or coke-addled paranoia. While Tony was similarly unlikeable, the film ‘Scarface’ still showed the negative impact of Tony’s actions throughout the film, whether it’s the breakdown of his relationship with his family or downfall of his empire.\nIn comparison, Frank’s character is more like Charles Bronson in ‘Death Wish’ – an insecure and hypermasculine male with no regard for anyone else’s conundrums. They live completely inside their own head. While this mentality is justified through Frank’s imprisonment, this still provides very little space for emotional development. Frank continuously is arrogant and unable to learn. Leo (Robert Prosky) provides Frank with all he could possibly want from life and more; while Frank shows very little appreciation for the depths of Leo’s actions.\nThe film then rewards Frank for his behaviour as he murders all of his ex-partners in order to escape the criminal heat on him. Willie Nelson’s character is severely undeveloped and his death provides little motivation for Frank to continue the heist (which he was seemingly doing to get his buddy out of jail before he dies of heart disease. Tuesday Weld’s character ‘Jessie’ is similarly underdeveloped as she serves only as a prop for Frank’s character to marry and nurture his adopted child.\nHowever, the score (created by Tangerine Dream) is outstanding as the light synthesizers build tension during the heist and shootout scenes. The score is used sparingly as most of the dialogue is backed with silence – which allows the instances the score is used to be far more grand and emphatic in cinematic emotion.\nOverall, this film is just a’ight. Good action, poor (or outdated) characterisations but excellent score and realism when it comes to the actual heist scene.",
    "review_score": 5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/22-thief-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/22-thief/thief-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/22-thief/thief-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/22-thief/thief-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/22-thief/thief-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/22-thief/thief-5.png"
    ],
    "headline": "TOXIC MASCULINITY: THE MOVIE",
    "comments": []
  },
  {
    "title": "Seven Samurai",
    "film_id": 23,
    "director": "Akira Kurosawa",
    "year": 1954,
    "runtime": "03:27",
    "genre": ["Epic", "Drama", "Foreign Language"],
    "writers": ["Akira Kurosawa", "Shinobu Hashimoto", "Hideo Oguni"],
    "cinematography": ["Asakazu Nakai"],
    "soundtrack": ["Fumio Hayasaka"],
    "notable_actors": [
      "Toshiro Mifune",
      "Takashi Shimura",
      "Daisuke Kato",
      "Isao Kimura",
      "Minoru Chiaki",
      "Seiji Miyaguchi",
      "Yoshio Inaba"
    ],
    "blurb": "A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.",
    "special_category": ["JAPANESE"],
    "tags": [
      "seven",
      "samurai",
      "japan",
      "foreign",
      "1950",
      "epic",
      "long",
      "drama",
      "akira",
      "kurosawa",
      "shinobu",
      "hideo",
      "asakazu",
      "nakai",
      "fumio",
      "toshiro",
      "mifune",
      "takashi",
      "shimura",
      "daisuke",
      "kato",
      "isao",
      "kimura",
      "minoru",
      "chiaki",
      "seiji",
      "miyaguchi",
      "yoshio",
      "inaba",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/5dZioLIejeo",
    "trivia": [
      "Kurosawa's original idea for the film was 'a day in the life of a samurai'",
      "First film in which Kurosawa used multiple cameras",
      "The film is set in 1586",
      "Akira Kurosawa had an ancenstor who was a samurai, roughly 100 years before the creation of this film",
      "After months of research, each of the seven major samurai were based on historical samurai",
      "Filming had to be stopped several times due to a shortage of horses for the final battle sequences",
      "Toshiro Mifune stayed in character the entire time he was on set"
    ],
    "review_text": "Akira Kurosawa’s 1954 classic ‘Seven Samurai’ is about a village that hires a bunch of unemployed samurai to defend themselves from a series of attackers and bandits. This is a long-ass movie and its premise is one of the most influential in cinema history. The core storyline of a troubled community banding a series of mercenaries together to defend them has been referenced and reworked a zillion times in world cinema. Classic video games like ‘Mass Effect 2’ even refer to this story arc with the search for Shephard’s allies in defending Earth and the Citadel.\nSamurai films are often seen as the Japanese equivalent to Cowboy westerns – and for good reason. They share many themes such as lone wolves fighting against bandits and thieves in a battle of morality in old-timey civilisations. I’m not sure I have a lot to say about this film that hasn’t already been said in a thousand film classes before. This is a certified classic in terms of overall production – dialogue? Excellent. Cinematography? Ground-breaking for the 1950s. Sound? Nostalgic of the stage-era of cinema. You feel for the peasants as they cry for better crop yields and livelihoods. There are clear-cut moral lines to help you feel for certain characters. It all makes me yearn for a simpler time – when women knew their place and when specific races weren’t allowed in certain restaurants (that’s right, I’m looking at you, Bulldog/Schnauzer cross-breed, you ugly fucking dog).\nNostalgia aside, this is a classic movie that everyone should watch unless you don’t care for old movies or Japanese cinema. Then just watch something new and English-language that rehashes the plot elements from this film, you’ll have the same experience as I did watching this movie and it’ll be a blast. Probably. It’s actually very entertaining once you get invested.\nI really didn’t feel like taking notes on this film because it’s nearly four-fucking hours and I’ve seen it already so I just watched it for fun. It was a lot less fun than the first time and made me regret adding this to my film list because it was a SLOG the second time-round.\nHonestly if you want to read something in-depth about this movie, go visit the Film department in the Arts sector of your local University – it’ll be the rundown building down several flights of stairs beside the janitor’s closet. You’ll know you’re there when you feel like you’ve just entered Auschwitz.\nYou know what? Fuck this film for making me spend nearly four hours bored out of my mind, I give it a star and a half out of five because it sucks the second time.",
    "review_score": 3,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/23-samurai-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/23-seven_samurai/samurai-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/23-seven_samurai/samurai-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/23-seven_samurai/samurai-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/23-seven_samurai/samurai-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/23-seven_samurai/samurai-5.jpg"
    ],
    "headline": "Seven seems a bit excessive, no?",
    "comments": []
  },
  {
    "title": "Parasite",
    "film_id": 24,
    "director": "Bong Joon-ho",
    "year": 2019,
    "runtime": "02:12",
    "genre": ["Comedy", "Thriller", "Foreign Language"],
    "writers": ["Bong Joon-ho", "Han Jin-won"],
    "cinematography": ["Hong Kyung-pyo"],
    "soundtrack": ["Jung-Jae-il"],
    "notable_actors": [
      "Song Kang-ho",
      "Choi Woo-shik",
      "Lee Sun-kyun",
      "Cho Yeo-jeong",
      "Park So-dam",
      "Lee Jung-eun"
    ],
    "blurb": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
    "special_category": ["DOPE KOREAN CINEMA"],
    "tags": [
      "parasite",
      "class",
      "2010",
      "comedy",
      "thriller",
      "korea",
      "foreign",
      "bong",
      "joon-ho",
      "song",
      "kang-ho",
      "choi",
      "woo-shik",
      "lee",
      "sun-kyun",
      "cho",
      "yeo-jeong",
      "park",
      "so-dam",
      "jung-eun",
      "academy",
      "award"
    ],
    "trailer": "https://www.youtube.com/embed/5xH0HfJHsaY",
    "trivia": [
      "The Parks' house was completely built from scratch for this movie",
      "Ki-woo's job as a home tutor was chosen because it's one of the only ways a lower class and upper class individual would ever meet in South Korean society",
      "Edited in Final Cut Pro 7, a program that stopped receiving support in 2011, on a computer that had not received a software updated since 2014. The film won an Oscar for editing.",
      "Shot in 77 days",
      "The house was designed to feature lines that clearly divide the Parks and Kims",
      "Face mud mask was used for the flooding scene to give the water a sewage look"
    ],
    "review_text": "Bong Joon-ho’s 2019 Academy Award Best Picture winning film ‘Parasite’ is an entertaining look into the socio-economic dynamics of South Korean society. Personally (which is what you’re here for), I blame this all on hyper-capitalist American influence poisoning South Korean culture with it’s ‘all work, no play, MAKE LOTS OF MONEY’ mantra causing all this damn economic inequality and corporatism. Regardless of your views on economic policy, it’s largely irrelevant because economics only provides context (although great for a thorough watch) for the core narrative – which is the evolving relationship between a seemingly unconnected lower-class group of people and their wealthy employers.\nThe film is dense with humour, horror elements and tension that carry it through a tightly scripted two hour runtime. The keen intelligence and innovation of the Kim family struggling to maintain employment status for each member through the wealthy Park family is somehow both humorous to watch and anxiety-inducing. Additionally, the constructed sets, costumes and props all add to the distinction of classes between the two families. Bong Joon-ho also uses cinematic framing and direction to expertly guide our eyes and emotions with subtlety and poise. Elements of horror and suspense are also sprinkled throughout to keep a sense of tension and unease that help to build to an unnerving and surprising climax that is well worth the invested time.",
    "review_score": 8,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/24-parasite-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/24-parasite/parasite-1.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/24-parasite/parasite-2.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/24-parasite/parasite-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/24-parasite/parasite-4.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/24-parasite/parasite-5.jpg"
    ],
    "headline": "COMPARING THE IMPOVERISHED TO INSECTS WOW, REAL EMPATHETIC, BONG",
    "comments": []
  },
  {
    "title": "Bad Lieutenant",
    "film_id": 25,
    "director": "Abel Ferrera",
    "year": 1992,
    "runtime": "01:36",
    "genre": ["Neo-Noir", "Crime"],
    "writers": ["Zoe Lund", "Abel Ferrera"],
    "cinematography": ["Ken Kelsch"],
    "soundtrack": ["Joe Delia"],
    "notable_actors": ["Harvey Keitel", "Zoe Lund", "Victor Argo"],
    "blurb": "While investigating a young nun's rape, a corrupt New York police detective (Harvey Keitel), with a serious drug and gambling addiction, tries to change his ways and find forgiveness and redemption.",
    "special_category": ["NASTY"],
    "tags": [
      "bad",
      "lieutenant",
      "abel",
      "ferrera",
      "1990",
      "neo",
      "noir",
      "crime",
      "zoe",
      "lund",
      "joe",
      "delia",
      "harvey",
      "keitel",
      "victor",
      "argo",
      "cop",
      "corrupt"
    ],
    "trailer": "https://www.youtube.com/embed/oFvGeMDW7bw",
    "trivia": [
      "Harvey Kietel remained in character on set throughout production",
      "Much of the film was shot guerilla style - Ferrara didn't bother with permits, particularly the nightclub scene where Kietel walks directly through a functioning club",
      "Abel Ferrara and Zoe Lund were abusing cocaine and heroin during the production of this film",
      "Was originally to be a comedy but Kietel's portrayal changed this",
      "A lot of the film's script and dialogue was improvised with only about 60 pages completed",
      "Zoe Lund claimed there was a lot of rewriting on set, with characters cut, added or altered in personality often"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/25-bad_lieu-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/25-bad_lieut/bad_lieu-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/25-bad_lieut/bad_lieu-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/25-bad_lieut/bad_lieu-5.png"
    ],
    "headline": "R.I.P ZOE LUND",
    "comments": []
  },
  {
    "title": "Ran",
    "film_id": 26,
    "director": "Akira Kurosawa",
    "year": 1985,
    "runtime": "2:42",
    "genre": ["Epic", "War", "Drama"],
    "writers": [
      "Akira Kurosawa",
      "Hideo Oguni",
      "Masato Ide",
      "William Shakespeare"
    ],
    "cinematography": ["Takao Saito", "Masaharu Ueda", "Asakazu Nakai"],
    "soundtrack": ["Toru Takemitsu"],
    "notable_actors": [
      "Tatsuya Nakadai",
      "Akira Terao",
      "Jinpachi Nezu",
      "Daisuke Ryu",
      "Meiko Harada"
    ],
    "blurb": "In Medieval Japan, an elderly warlord retires, handing over his empire to his three sons. However, he vastly underestimates how the new-found power will corrupt them and cuase them to turn on each other... and him",
    "special_category": ["JAPANESE"],
    "tags": [
      "ran",
      "akira",
      "kurosawa",
      "1980",
      "epic",
      "war",
      "drama",
      "hideo",
      "masato",
      "toru",
      "takao",
      "saito",
      "masaharu",
      "ueda",
      "japan"
    ],
    "trailer": "https://www.youtube.com/embed/YwP_kXyd-Rw",
    "trivia": [
      "Akira Kurosawa's wife of 39 years died during production; he halted filming for one day to mourn before returning to production",
      "Several hundred costumes were all created by hand, a process taking two years to complete",
      "Kurosawa began writing the film 10 years before its release and said that it wasn't originally meant to be based on Shakespeare's 'King Lear' but it came to that during the writing process",
      "The film used approx. 1400 extras and 200 horses. 1400 suits of armour (designed by Kurosawa himself) were fabricated and a number of horses had to be sourced from the United States",
      "Almost the entire film is framed in long-shots and there are only a handful of close-ups",
      "Kurosawa told Sidney Lumet he chose to frame a shot because if he moved the camera to the left, the Sony factory would be seen and if he moved the camera to the right, an airport would be seen"
    ],
    "review_text": "Based on William Shakespeare’s classic ‘King Lear’, this two and a half hour expedition into medieval Japan is an enthralling, captivating, surreal and picturesque film that rounded out Akira Kurosawa’s career in the perfect way before his passing. It’s also lovely that he colour-codes every son’s kimono (?) so you can easily tell who’s who.\nThis film is beautifully shot and contrasts well with the rest of Kurosawa’s most influential films – which were mostly black-and-white. This film shows Kurosawa and cinematographer’s Takao Saito, Masaharu Ueda and Asakazu Nakai’s creative and technical talent in crafting vibrant, complex and layered paintings through each frame. As far as epic films go, this may be one of the most visually compelling. You feel completely immersed in in the meticulously curated long-shots and windy landscapes.\nAs far as narratives go, this is a classic Kurosawa take on a Shakespearean tragedy. That will either entice you or make you fall asleep. Personally, it was in the middle for me. I didn’t fall asleep but I mean, it’s Shakespeare, you know. That being said, the Kurosawa elements in score, Japanese cultural elements and humour are visibly apparent and a large part of the particular charm this film has in differentiating itself from most contemporary Shakespeare adaptations.",
    "review_score": 7,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/26-ran-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/26-ran/ran-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/26-ran/ran-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/26-ran/ran-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/26-ran/ran-4.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/26-ran/ran-5.jpg"
    ],
    "headline": "A LESSON IN CHILDFREEDOM",
    "comments": []
  },
  {
    "title": "Once Upon a Time in America",
    "film_id": 27,
    "director": "Sergio Leone",
    "year": 1984,
    "runtime": "03:49",
    "genre": ["Epic", "Crime"],
    "writers": [
      "Leonardo Benevenuti",
      "Piero De Bernadi",
      "Enrico Medioli",
      "Franco Arcalli",
      "Franco Ferrini"
    ],
    "cinematography": ["Tonino Delli Colli"],
    "soundtrack": ["Ennio Morricone"],
    "notable_actors": [
      "Robert De Niro",
      "James Woods",
      "Elizabeth McGovern",
      "Joe Pesci",
      "Danny Aiello",
      "Jennifer Connelly"
    ],
    "blurb": "A former Prohibition-era Jewish gangster (Robert De Niro) returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.",
    "special_category": ["DE NIRO-SCORSESE CONNECTION"],
    "tags": [
      "once",
      "upon",
      "a",
      "time",
      "in",
      "america",
      "sergio",
      "leone",
      "1980",
      "epic",
      "long",
      "crime",
      "ennio",
      "morricone",
      "robert",
      "de niro",
      "james",
      "woods",
      "elizabeth",
      "mcgovern",
      "joe",
      "pesci",
      "danny",
      "aiello",
      "jennifer",
      "connelly"
    ],
    "trailer": "https://www.youtube.com/embed/lFw062jAYR0",
    "trivia": [
      "When filming was complete, the footage ran to about 8 to 10 hours. Sergio Leone Nino Baragli trimmed this down to six hours with plans of 2 three-hour films - this was eventually cut to 3 hours-48 minutes",
      "The film takes place in 1920, 1932, 1933 and 1968",
      "Sergio Leone's final film and first in thirteen years since 'A Fistful of Dynamite'",
      "Sergio Leone refused to direct 'The Godfather', which may have led to him wanting to direct a gangster film",
      "Robert De Niro was the first actor cast",
      "The US distributor reportedly failed to file the appropriate paperwork for Ennio Morricone's score (regarded as one of his best) in time for the Academy Awards",
      "Ennio Morricone reportedly finished the score before the film had even been halfway completed"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/27-once-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/27-once_upon/once-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/27-once_upon/once-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/27-once_upon/once-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/27-once_upon/once-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/27-once_upon/once-5.jpg"
    ],
    "headline": "WHAT HAPPENS WHEN THE ANTI-SEMITES GET WHAT THEY GOT COMING",
    "comments": []
  },
  {
    "title": "Rope",
    "film_id": 28,
    "director": "Alfred Hitchcock",
    "year": 1948,
    "runtime": "01:20",
    "genre": ["Crime", "Mystery"],
    "writers": ["Arthur Laurents"],
    "cinematography": ["Hume Cronyn"],
    "soundtrack": ["Joseph A. Valentine", "William V. Skall"],
    "notable_actors": [
      "James Stewart",
      "John Dall",
      "Farley Granger",
      "Joan Chandler"
    ],
    "blurb": "Two men (John Dall & Farley Granger) attempt to prove they committed the perfect crime by hosting a dinner party after strangling their former classmate to death (Dick Hogan).",
    "special_category": ["OLD ASS SHIT", "HITCHCOCK WAS A CUNT", "SINGLE-SET"],
    "tags": [
      "rope",
      "alfred",
      "hitchcock",
      "1940",
      "psych",
      "crime",
      "thriller",
      "james",
      "stewart",
      "john",
      "dall",
      "farley",
      "granger",
      "joan",
      "chandler",
      "lgbt",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/8xkQoH8QbVs",
    "trivia": [
      "Since filming times were so long, everyone on set tried their best to avoid mistakes",
      "At one point during the film, the camera dolly ran over a cameraman's leg and he was gagged and dragged off set so as not to ruin the take",
      "The only film James Stewart made with Alfred Hitchcock that he did not like",
      "Considered to be Hitchcock's most controversial film upon release; it was banned in several American theaters",
      "Hitchcock only managed to shoot roughly one segment per day and the last four had to be reshot because he did not like the colour of the sunset",
      "James Stewart was paid USD$300 000 for this film, with a budget of USD$1.5M (1/5 the budget)"
    ],
    "review_text": "The first thing you should know about this movie is that when the opening credits roll (as they do in many old timey films), the final credit reads ‘DIRECTED BY ALFRED HITCHCOCK’ in a font size about twice the size of my ass (which is pretty fucking huge) – so you know this movie is as pretentious as its’ homophobe director.\nI have mixed feelings about this film. On one hand, the story of a couple of college-educated killers attempting to pull off the perfect murder is an interesting tale – particularly as it comes after the end of World War II, where themes of morality and fascism are heavily apparent. A particular conversation early on in the dinner party where Rupert lures fascist opinion from Brandon – ‘advocating for inferior beings to be culled’ strikes discomfort with party guests as Brandon seemingly does not detect the satire in Rupert’s tone. These discussions reference Hitler’s recent atrocities and provide a clear window into Brandon’s psyche. This is juxtaposed with Philip’s tense, scatty demeanour that is clearly affected by his recent actions.\nAlfred Hitchcock’s direction follows the suspense with extremely long takes to make the film seem like one long scene which was innovative for the time.\nOn the other hand, I feel the film squanders all the tension and suspense it builds with the departure of all of the party guests following David’s strange disappearance. Once all the party guests leave, Brandon basks in the glory of a perfectly executed murder and dinner party (likely to provide an alibi for the two). It’s unclear what the departure of the guests is supposed to achieve, as Rupert returns on an unsettling hunch that Brandon and Philip have something to do with David’s disappearance. Claiming to have forgotten his cigarette case and planting it on top of David’s coffin (unbeknownst to Rupert), it seems that this scene would have been more effective and entertaining with the presence of the remaining guests.\nPersonally, the film feels unfinished due to this – and it’s 80 minute run time – which could have been expanded to portray the other guests’ reactions and feelings towards David’s murder. It feels particularly strange to omit David’s fiancee Janet and parents (all of whom attended the dinner party) from discovering this revelation, especially because these characters provide a lot of personality and depth to their scenes.\nThe end scene, which depicts Rupert becoming flustered by Brandon’s twisted interpretation of his own words falls flat due to the missing presence of important characters. If they were not essential to this scene, I’m not sure what their purpose in the film was to begin with aside from being discardable emotional props.\nAll in all, I was excited and enthralled with this film from early to late middle point. The singular setting provided an episodic and familiar tone that could have been exploited for further drama had all the characters stayed where they were. This leads to an extremely underwhelming climax that makes me wish I’d never started watching this film in the first place. What a waste of time.",
    "review_score": 4,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/28-rope-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/28-rope/rope-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/28-rope/rope-2.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/28-rope/rope-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/28-rope/rope-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/28-rope/rope-5.png"
    ],
    "headline": "HOMOPHOBIA WAS REAL COOL IN THE FOURTIES",
    "comments": []
  },
  {
    "title": "Zero Dark Thirty",
    "film_id": 29,
    "director": "Kathryn Bigelow",
    "year": 2012,
    "runtime": "02:37",
    "genre": ["Thriller", "Biographical"],
    "writers": ["Mark Boal"],
    "cinematography": ["Greig Frasier"],
    "soundtrack": ["Alexandre Desplat"],
    "notable_actors": ["Jessica Chastain", "Jennifer Ehle", "James Gandolfini"],
    "blurb": "A chronicle of the decade-long hunt for al-Qaeda terrorist leader Osama bin Laden (Ricky Sekhon) after the September 2001 attacks, and his death at the hands of the Navy S.E.A.L.s Team Six in May 2011.",
    "special_category": ["OBAMA SAVES THE WORLD"],
    "tags": [
      "zero",
      "dark",
      "thirty",
      "kathryn",
      "bigelow",
      "2010",
      "thriller",
      "biographical",
      "jessica",
      "chastain",
      "jennifer",
      "ehle",
      "james",
      "gandolfini",
      "osama",
      "bin",
      "laden",
      "terrorist",
      "9/11",
      "obama",
      "war",
      "afghanistan",
      "pakistan"
    ],
    "trailer": "https://www.youtube.com/embed/LJFra3B9sbA",
    "trivia": [
      "The film was originally about the decade long hunt for Osama bin Laden and was completely rewritten after he was killed",
      "The four-lens night vision goggles used by SEAL Team Six are real - in fact cutting edge",
      "While called 'Osama', the term 'Usama' or 'UBL' is the more common term for Osama bin Laden within the intelligence community",
      "The man who killed bin Laden stated in his biography that the real agent Jessica Chastain portrayed was the bravest woman he's ever met in his life",
      "The climactic sequence devoted to the raid on Osama's compound runs about 25 minutes, only a few minutes less than the real-life SEAL assault",
      "Screenwriter Mark Boal had to share his script with CIA officers, and they removed a scene where a drunk CIA officer fires an AK-47 into the air from a rooftop in Islamabad",
      "Rooney Mara was originally cast as Maya but had to drop out"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/29-zero-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/29-zero_dark/zero-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/29-zero_dark/zero-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/29-zero_dark/zero-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/29-zero_dark/zero-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/29-zero_dark/zero-5.jpg"
    ],
    "headline": "DEATH (AND BRUTAL TORTURE) TO THE ENEMIES OF AMERICA",
    "comments": []
  },
  {
    "title": "In the Mood For Love",
    "film_id": 30,
    "director": "Wong Kar-wai",
    "year": 2001,
    "runtime": "01:38",
    "genre": ["Romance", "Drama", "Foreign Language"],
    "writers": ["Wong Kar-wai"],
    "cinematography": ["Christopher Doyle", "Mark Lee Ping Bin"],
    "soundtrack": ["Michael Galasso", "Shigeru Umebayashi"],
    "notable_actors": ["Maggie Cheung", "Tony Leung"],
    "blurb": "Two neighbours (Maggie Cheung & Tony Leung) form a strong bond after both suspect extramarital activities of their spouses. However, they agree to keep their bond platonic so as not to commit similar wrongs.",
    "special_category": ["PRETENTIOUS ART"],
    "tags": [
      "in",
      "the",
      "mood",
      "for",
      "love",
      "wong",
      "kar-wai",
      "2000",
      "romance",
      "drama",
      "hong",
      "kong",
      "foreign",
      "maggie",
      "cheung",
      "tony",
      "leung",
      "art"
    ],
    "trailer": "https://www.youtube.com/embed/m8GuedsQnWQ",
    "trivia": [
      "Kar-Wai Wong shot the ending and edited the film a little over a week before its' Cannes debut",
      "Filming was shifted from Beijing to Macau after Chinese authorities demanded to see the completed script.",
      "Maggie Cheung wears a different cheongsam dress in every scene. There were 46 dresses in total, though not all made it to the final cut",
      "Filming took fifteen months",
      "Original cut was 130 minutes lon, before 32 minutes were cut to achieve the 99 minute theatrical cut"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/30-mood-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/30-in_love/mood-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/30-in_love/mood-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/30-in_love/mood-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/30-in_love/mood-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/30-in_love/mood-5.jpg"
    ],
    "headline": "FORBIDDEN LOVE IS SO ROMANTIC AW",
    "comments": []
  },
  {
    "title": "Battleship Potemkin",
    "film_id": 31,
    "director": "Sergei Eisenstein",
    "year": 1925,
    "runtime": "01:15",
    "genre": ["Silent", "Foreign Language", "War"],
    "writers": ["Nina Agadzhanova", "Sergei Eisenstein"],
    "cinematography": ["Eduard Tisse"],
    "soundtrack": ["Edmund Meisel"],
    "notable_actors": [
      "Aleksandr Antonov",
      "Vladimir Barksy",
      "Grigori Aleksandrov"
    ],
    "blurb": "In the midst of the Russian Revolution of 1905, the crew of the battleship Potemkin mutiny against the brutal, tyrannical regime of the vessel's officers. The resulting street demonstration in Odessa brings on a police massacre.",
    "special_category": ["OLD ASS SHIT", "SOVIET"],
    "tags": [
      "battleship",
      "potemkin",
      "sergei",
      "eisenstein",
      "1920",
      "silent",
      "russian",
      "soviet",
      "tisse",
      "aleksandr",
      "antonov",
      "classic"
    ],
    "trailer": "https://www.youtube.com/embed/kS5kzTbNKjs",
    "trivia": [
      "Film censorship boards of several countries felt this movie would spread communism",
      "Charlie Chaplin said this was his favourite film",
      "Film takes place in June 1905",
      "Banned in France and the UK in 1953 and 1954 respectively, after the death of Stalin",
      "The steps sequence in this film inspired the shootout in 'The Untouchables'",
      "The famous Odessa steps sequence was not in the script, but devised during production"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/31-battleship-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/31-battleship/battleship-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/31-battleship/battleship-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/31-battleship/battleship-3.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/31-battleship/battleship-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/31-battleship/battleship-5.jpg"
    ],
    "headline": "TIME TO UN-SEIZE THE MEANS OF PRODUCTION, COMRADE",
    "comments": []
  },
  {
    "title": "Miami Vice",
    "film_id": 32,
    "director": "Michael Mann",
    "year": 2006,
    "runtime": "02:12",
    "genre": ["Action", "Crime"],
    "writers": ["Michael Mann"],
    "cinematography": ["Dion Beebe"],
    "soundtrack": ["John Murphy"],
    "notable_actors": [
      "Jamie Foxx",
      "Colin Farrell",
      "Gong Li",
      "Naomie Harris",
      "Justin Theroux"
    ],
    "blurb": "Miami-Dade Police Department detectives Sonny (Colin Farrell) and Rico (Jamie Foxx) go undercover to fight drug trafficking operations",
    "special_category": [""],
    "tags": [
      "miami",
      "vice",
      "2000",
      "action",
      "crime",
      "michael",
      "mann",
      "dion",
      "john",
      "murphy",
      "jamie",
      "foxx",
      "colin",
      "farrell",
      "gong",
      "li",
      "naomie",
      "harris",
      "justin",
      "theroux"
    ],
    "trailer": "https://www.youtube.com/embed/6WCKJ7KaIZY",
    "trivia": [
      "Mann had his actors train with real-life undercover law enforcement officers - both observing operations from a safe distance. ",
      "Farrell participated in an allegedly real sting-operation with officers and had a gun drawn on him - leaving him with anxiety and insomnia that night until he was told it was staged",
      "Crew members criticized many of Mann's decisions on set, such as script changes, filming in unsafe weather conditions, and even drafting gang members to provide security",
      "Filming in Miami took place during hurricane season",
      "Colin Farrell received top billing in European advertising while Jamie Foxx received top billing in American markets",
      "Farrell is 11 years younger than his love interest - Gong Li"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/32-miami-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/32-miami_vice/32-miami-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/32-miami_vice/32-miami-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/32-miami_vice/32-miami-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/32-miami_vice/32-miami-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/32-miami_vice/32-miami-5.png"
    ],
    "headline": "PUSH IT TO THE LIMIT (LIMIIIIT) x10",
    "comments": []
  },
  {
    "title": "Raging Bull",
    "film_id": 33,
    "director": "Martin Scorsese",
    "year": 1980,
    "runtime": "02:09",
    "genre": ["Drama", "Biographical"],
    "writers": [
      "Paul Schrader",
      "Mardik Martin",
      "Jake LaMotta",
      "Joseph Carter",
      "Peter Savage"
    ],
    "cinematography": ["Michael Chapman"],
    "soundtrack": ["Robbie Robertson"],
    "notable_actors": [
      "Robert De Niro",
      "Joe Pesci",
      "Cathy Moriarty",
      "Frank Vincent",
      "Theresa Saldana"
    ],
    "blurb": "The life of boxer Jake LaMotta (Robert De Niro), whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
    "special_category": ["DE NIRO-SCORSESE CONNECTION"],
    "tags": [
      "raging",
      "bull",
      "martin",
      "scorsese",
      "1980",
      "drama",
      "biographical",
      "sports",
      "paul",
      "schrader",
      "jake",
      "lamotta",
      "robbie",
      "robertson",
      "robert",
      "de niro",
      "joe",
      "pesci",
      "cathy",
      "moriarty",
      "frank",
      "vincent",
      "theresa",
      "saldana",
      "black",
      "white"
    ],
    "trailer": "https://www.youtube.com/embed/yUp6d79WRVI",
    "trivia": [
      "When the real Jake LaMotta saw the film for the first time, he realised for the first time how much of a terrible person he was",
      "In 1978 Scorsese was at an all-time low after his latest film 'New York, New York' bombed at the box-office and nearly overdosed on cocaine before Robert De Niro visited him in hospital and told him to clean up and make this film about a boxer",
      "In preparation for his role, Robert De Niro went through extensive physical training and entered in three genuine Brooklyn boxing matches, winning two of them",
      "Robert De Niro accidentally broke Joe Pesci's rib during the sparring scene",
      "Scorsese shunned the idea of filming the boxing scenes with multiple cameras, instead planning months of choreographed fights",
      "Joe Pesci and Robert De Niro are actually punching each other in the famous 'hit me' scene",
      "The film is black-and-white for period authenticity, but also to differentiate from 'Rocky' and other boxing films releasing around the same time"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/33-raging-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/33-raging_bull/raging-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/33-raging_bull/raging-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/33-raging_bull/raging-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/33-raging_bull/raging-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/33-raging_bull/raging-5.jpg"
    ],
    "headline": "ROBERT 'WIFE BEATER' DE NIRO",
    "comments": []
  },
  {
    "title": "Come and See",
    "film_id": 34,
    "director": "Elem Kilmov",
    "year": 1985,
    "runtime": "02:22",
    "genre": ["War", "Horror", "Foreign Language"],
    "writers": ["Ales Adamovich"],
    "cinematography": ["Aleksei Rodionov"],
    "soundtrack": ["Oleg Yanchenko"],
    "notable_actors": ["Aleksei Kravchenko", "Olga Mironova"],
    "blurb": "After finding an old rifle, a young boy (Aleksei Kravchenko) joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II.",
    "special_category": ["SOVIET"],
    "tags": [
      "come",
      "and",
      "see",
      "elem",
      "kilmov",
      "1980",
      "war",
      "horror",
      "ww2",
      "wwii",
      "holocaust",
      "russian",
      "soviet",
      "anti",
      "aleksei",
      "kravchenko",
      "olga"
    ],
    "trailer": "https://www.youtube.com/embed/BcCbX1fqFKA",
    "trivia": [
      "Live ammunition was used in the film, actor Aleksey Kravchenko described bullets passing around 10cm above his head",
      "The director planned to have Aleksey Kravchenko hypnotised by a psychotherapist during most of the dreadful and violent scenes so they wouldn't affect his young mind - but he was not susceptible and went along with it",
      "Filmed in chronological sequence",
      "Many of the uniforms seen throughout are originals",
      "Some of the German soldiers are seen using Russian weapons - this is correct as they were less likely to jam and could work at lower temperatures than many German-made guns",
      "It's been said that Aleksey Kravchenko was so overwhelmed with the film's subject matter that his hair turned gray during filming",
      "The film's closing epilogue states 'The Nazis burned down 628 Belarussian villages together with all the people in them.'"
    ],
    "review_text": "Make no mistake, while labelled a war film – this is without a doubt, one of the most terrifying films I’ve ever witnessed. To be fair, I don’t generally watch horror films so it’s a small sample size but in terms of intensity, this film is up there. A lot of this intensity stems from the events depicted in the film being too real and straight from the memories of the writers / director.\nSet in 1943, two Belarusian boys dig up a couple of rifles in order to be able to enter the Soviet partisan forces. Youthful idealism and glorification of war is a foundational theme in this film and we are exposed to this almost instantly. As partisans arrive to one of the boys (Flyora) house, we see the terror in his mother’s eyes as she pleads with the partisans and her son to not participate.\nThis is both one of my favourite films on account of the sheer emotion and authenticity on display, and one of my least favourite for the exhaustive toll it takes on you watching it. The film felt so genuine and terrifying that the Flyora’s real actor (Aleksei Kravchenko) hair started greying and the boy experienced PTSD. This is a film only to watch if you’re ready for it.",
    "review_score": 9,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/34-come_see-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/34-come_see/come_see-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/34-come_see/come_see-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/34-come_see/come_see-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/34-come_see/come_see-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/34-come_see/come_see-5.jpeg"
    ],
    "headline": "FUCK NAZIS",
    "comments": []
  },
  {
    "title": "A Scanner Darkly",
    "film_id": 35,
    "director": "Richard Linklater",
    "year": 2006,
    "runtime": "01:40",
    "genre": ["Science Fiction", "Animated"],
    "writers": ["Philip K. Dick", "Richard Linklater"],
    "cinematography": ["Shane F. Kelly"],
    "soundtrack": ["Graham Reynolds"],
    "notable_actors": [
      "Keanu Reeves",
      "Robert Downey Jr.",
      "Woody Harrelson",
      "Winona Ryder"
    ],
    "blurb": "An undercover cop (Keanu Reeves) in a not-too-distant future becomes involved with a dangerous new drug and begins to lose his own identity as a result.",
    "special_category": ["TECH-NOIR"],
    "tags": [
      "a",
      "scanner",
      "darkly",
      "richard",
      "linklater",
      "2000",
      "psych",
      "sci-fi",
      "science fiction",
      "animated",
      "philip",
      "dick",
      "shane",
      "kelly",
      "keanu",
      "reeves",
      "robert",
      "downey jr",
      "woody",
      "harrelson",
      "winona",
      "ryder"
    ],
    "trailer": "https://www.youtube.com/embed/hkjDUERgCQw",
    "trivia": [
      "Robert Downey Jr. wrote most of his lines down on post-it notes and scattered them around the set so he could read off them while filming a scene",
      "Filming was completed in 23 days, the animation took eighteen months",
      "Based on Phillip K. Dick's personal drug experiences",
      "Alex Jones (the right-wing nutcase) cameos in this film as a right-wing nutjob",
      "The film takes place in 2013",
      "When Freck goes to the liquor store, one of the brands of wine is 'Ubik' (the name of a Philip K. Dick novel)"
    ],
    "review_text": "I’ve always found Robert Downey Jr. scummy and that opinion has not changed.\nNow that’s out the way, on the positive, Keanu Reeves is great in this as he plays an undercover cop ‘Arctor’ as he attempts to infiltrate a smuggling ring in this adaptation of a classic Philip K. Dick novel. I entered this with high expectations, and was left slightly disappointed in that I feel the script was half-baked in terms of dialogue. Both Reeves and Downey Jr. had cringeworthy lines and played two-dimensional stereotypes (in Reeves case, his typecast role as quiet, introverted detective and Downey Jr as skeevy drug addict – which wasn’t exactly acting) that I feel could’ve been better expanded on. Additionally, Winona Ryder is underused as Arctor’s dealer and feel she could have been better incorporated into the plot.\nNonetheless, the rotoscope animation is fascinating and worth the watch if you’re into animation. While I feel the animation can feel outdated and cheap at times, it’s still interesting enough because it stands out from most other films in this genre.\nI’m surprised by how under-the-radar this film seemed to be when it came out, but I suppose both Keanu Reeves and Robert Downey Jr. are hotter assets now than they were a decade and a half ago.",
    "review_score": 4.5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/35-scanner-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/35-scanner/scanner-1.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/35-scanner/scanner-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/35-scanner/scanner-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/35-scanner/scanner-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/35-scanner/scanner-5.jpg"
    ],
    "headline": "THAT SNIVELLING RAT, ROBERT DOWNEY JR.",
    "comments": []
  },
  {
    "title": "La Haine",
    "film_id": 36,
    "director": "Matthieu Kassovitz",
    "year": 1995,
    "runtime": "01:38",
    "genre": ["Drama", "Foreign Language"],
    "writers": ["Mathieu Kassovitz"],
    "cinematography": ["Pierre Aim"],
    "soundtrack": ["Assassin"],
    "notable_actors": ["Vincent Cassel", "Hubert Kounde", "Said Taghmaoui"],
    "blurb": "24 hours in the lives of three young men (Vincent Cassel, Hubert Kounde, Said Taghmaoui) in the French suburbs the day after a violent riot.",
    "special_category": ["FRENCH"],
    "tags": [
      "la",
      "haine",
      "matthieu",
      "kassovitz",
      "drama",
      "france",
      "foreign",
      "assassin",
      "vincent",
      "cassel",
      "hubert",
      "kounde",
      "said",
      "taghmaoui",
      "1990"
    ],
    "trailer": "https://www.youtube.com/embed/FKwcXt3JIaU",
    "trivia": [
      "Was originally filmed in colour but changed to black-and-white in post-production",
      "A colour re-release was planned in case the black-and-white version flopped",
      "The scene with Vinz in the bathroom looking into the mirror was filmed with two actors mimicking each other",
      "The names of the characters are the their real life names",
      "Real police officers were highly offended by how their counterparts were portrayed in this film",
      "Title translates to: 'The Hate'"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/36-haine-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/36-la_haine/haine-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/36-la_haine/haine-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/36-la_haine/haine-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/36-la_haine/haine-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/36-la_haine/haine-5.jpg"
    ],
    "headline": "A LOT LESS PRETENTIOUS FRENCH CINEMA BECAUSE IT FEATURES ETHNICS",
    "comments": []
  },
  {
    "title": "8 1/2",
    "film_id": 37,
    "director": "Federico Fellini",
    "year": 1963,
    "runtime": "02:18",
    "genre": ["Comedy", "Drama", "Foreign Language"],
    "writers": [
      "Frederico Fellini",
      "Tullio Pinelli",
      "Ennio Flaiano",
      "Brunello Rondi"
    ],
    "cinematography": ["Gianni Di Venanzo"],
    "soundtrack": ["Nino Rota"],
    "notable_actors": [
      "Marcello Mastroianni",
      "Claudia Cardinale",
      "Anouk Aimee",
      "Sandra Milo",
      "Rosella Falk",
      "Barbara Steele"
    ],
    "blurb": "A harried movie director (Marcello Mastroianni) retreats into his memories and fantasies",
    "special_category": ["ITALIAN", "PRETENTIOUS ART"],
    "tags": [
      "8",
      "eight",
      "1/2",
      "half",
      "and",
      "comedy",
      "drama",
      "italy",
      "foreign",
      "classic",
      "frederico",
      "fellini",
      "nino",
      "rota",
      "marcello",
      "mastroianni",
      "claudia",
      "cardinale",
      "anouk",
      "aimee",
      "sandra",
      "milo",
      "rosella",
      "falk",
      "barbara",
      "steele",
      "1960"
    ],
    "trailer": "https://www.youtube.com/embed/RmIC9pQ80Fk",
    "trivia": [
      "Shot completely without sound recording on set. All dialogue was dubbed during post-production",
      "Fellini attached a note to himself below the camera's eyepiece that said 'remember, this is a comedy'",
      "David Lynch's favourite movie",
      "Many of the actors in the film go by their own real-life names",
      "Title refers to the number of films Federico Fellini had directed up until that point",
      "Fellini was well-known for working without a finished screenplay",
      "Often cited by Federico Fellini himself as one of his favourite films, even considering other directors' works"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/37-eight-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/37-fellini_eight/eight-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/37-fellini_eight/eight-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/37-fellini_eight/eight-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/37-fellini_eight/eight-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/37-fellini_eight/eight-5.jpg"
    ],
    "headline": "* SPAGHETTI *",
    "comments": []
  },
  {
    "title": "The Innocents",
    "film_id": 38,
    "director": "Jack Clayton",
    "year": 1961,
    "runtime": "01:40",
    "genre": ["Horror"],
    "writers": [
      "William Archibald",
      "Truman Capote",
      "John Mortimer",
      "Henry James"
    ],
    "cinematography": ["Freddie Francis"],
    "soundtrack": ["Georges Auric"],
    "notable_actors": [
      "Deborah Kerr",
      "Peter Wyngarde",
      "Megs Jenkins",
      "Michael Redgrave",
      "Pamela Franklin",
      "Martin Stephens"
    ],
    "blurb": "A young governess for two children becomes convinced that the house and grounds are haunted",
    "special_category": ["REAL BRITISH, INNIT"],
    "tags": [
      "innocents",
      "1960",
      "jack",
      "clayton",
      "horror",
      "william",
      "truman",
      "capote",
      "john",
      "henry",
      "freddie",
      "francis",
      "georges",
      "deborah",
      "kerr",
      "peter",
      "wyngarde",
      "megs",
      "jenkins",
      "michael",
      "pamela",
      "martin"
    ],
    "trailer": "https://www.youtube.com/embed/aOsF0S65RR0",
    "trivia": [
      "Deborah Kerr regarded this her finest performance",
      "Jack Clayton didn't want the children to be exposed to the darker themes of the story, so they never saw the screenplay in its entirety",
      "Freddie Francis used lots of huge, bright lamps to create the sharp visuals",
      "Truman Capote took a break from writing 'In Cold Blood' in order to rewrite the screenplay for this film",
      "Megs Jenkins was only four years older than Deborah Kerr"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/38-innocents_thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/38-the_innocents/innocents_1.JPG",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/38-the_innocents/innocents_2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/38-the_innocents/innocents_3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/38-the_innocents/innocents_4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/38-the_innocents/innocents_5.jpg"
    ],
    "headline": "WHAT IS BRITISH HORROR?",
    "comments": []
  },
  {
    "title": "Under the Skin",
    "film_id": 39,
    "director": "Jonathan Glazer",
    "year": 2013,
    "runtime": "01:48",
    "genre": ["Drama", "Horror", "Science Fiction"],
    "writers": ["Walter Campbell", "Jonathan Glazer"],
    "cinematography": ["Daniel Landin"],
    "soundtrack": ["Mica Levi"],
    "notable_actors": ["Scarlett Johansson"],
    "blurb": "A mysterious young woman seduces lonely men in the evening hours in Scotland. However, events lead her to begin a process of self-discovery.",
    "special_category": [""],
    "tags": [
      "under",
      "the",
      "skin",
      "jonathan",
      "glazer",
      "2010",
      "drama",
      "horror",
      "sci-fi",
      "science fiction",
      "walter",
      "daniel",
      "mica",
      "scarlett",
      "johansson"
    ],
    "trailer": "https://www.youtube.com/embed/7S1yhSp5jaI",
    "trivia": [
      "The men lured into the van by Scarlett Johansson's character were not actors, Jonathan Glazer only informed the men afterwards that they were in a movie",
      "Film took nearly ten years to be made, Brad Pitt was originally cast as one of the characters",
      "The first line of dialogue occurs 13 minutes into the film",
      "One of the locations where the film was shot caused a delay in production because there had been a murder in the next street over and police had cordoned off the area",
      "Championship motorcycle road racer Jeremy McWilliams was cast as the motorcyclist to handle the treacherous driving conditions of the Scottish highlands"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/39-uts-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/39-under_the_skin/uts-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/39-under_the_skin/uts-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/39-under_the_skin/uts-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/39-under_the_skin/uts-5.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/39-under_the_skin/uts-6.jpg"
    ],
    "headline": "TOTALLY WORTH IT",
    "comments": []
  },
  {
    "title": "Fantastic Planet",
    "film_id": 40,
    "director": "Rene Laloux",
    "year": 1973,
    "runtime": "01:11",
    "genre": ["Science Fiction", "Animated", "Surreal"],
    "writers": ["Rene Laloux", "Roland Topor"],
    "cinematography": ["Boris Baromykin", "Lubomir Rejthar"],
    "soundtrack": ["Alain Goraguer"],
    "notable_actors": [
      "Cynthia Adler",
      "Mark Gruner",
      "Barry Bostwick",
      "Hal Smith"
    ],
    "blurb": "On a faraway planet where blue giants rule, oppressed humanoids rebel against their machine-like leaders",
    "special_category": ["FRENCH"],
    "tags": [
      "fantastic",
      "planet",
      "rene",
      "laloux",
      "1970",
      "scifi",
      "science",
      "fiction",
      "roland",
      "boris",
      "lubomir",
      "alain",
      "goraguer",
      "cynthia",
      "adler",
      "mark",
      "gruner",
      "barry",
      "bostwick",
      "hal",
      "smith"
    ],
    "trailer": "https://www.youtube.com/embed/ZkIAkDsiUoo",
    "trivia": [
      "The first animated movie to be rated 'PG' in the United States",
      "Five years in the making, one of the reasons for this delay being Russia invading Czechoslovakia in 1968",
      "Although conceived in France, the film was animated in Czechoslovakia",
      "Won the special prize at the 1973 Cannes Film Festival"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/40-fantastic-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/40-fantastic_planet/fantastic-1.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/40-fantastic_planet/fantastic-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/40-fantastic_planet/fantastic-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/40-fantastic_planet/fantastic-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/40-fantastic_planet/fantastic-5.jpg"
    ],
    "headline": "MONSIEUR ACID MAN",
    "comments": []
  },
  {
    "title": "Platoon",
    "film_id": 41,
    "director": "Oliver Stone",
    "year": 1986,
    "runtime": "02:00",
    "genre": ["War"],
    "writers": ["Oliver Stone"],
    "cinematography": ["Robert Richardson"],
    "soundtrack": ["Georges Delerue"],
    "notable_actors": [
      "Tom Berenger",
      "Willem Dafoe",
      "Charlie Sheen",
      "Keith David",
      "Forest Whitaker",
      "Johnny Depp"
    ],
    "blurb": "Chris Taylor (Charlie Sheen), a neophyte recruit in Vietnam, finds himself caught in a battle of wills between two sergeants, one good (Willem Dafoe) and the other evil (Tom Berenger).",
    "special_category": ["WILLEM DAFOE IS A GREMLIN"],
    "tags": [
      "platoon",
      "oliver",
      "stone",
      "war",
      "1980",
      "robert",
      "richardson",
      "tom",
      "berenger",
      "willem",
      "dafoe",
      "charlie",
      "sheen",
      "keith",
      "david",
      "forest",
      "whitaker",
      "johnny",
      "depp"
    ],
    "trailer": "https://www.youtube.com/embed/KztP7SKe0uk",
    "trivia": [
      "In many US military leadership classes, the character of Lieutenant Wolfe is used as an example of how not to behave as a junior officer",
      "Oliver Stone wrote the first draft of this film in 1971 and sent it to Jim Morrison in hopes that he would play the character Charlie Sheen would ultimately play. Morrison had the script on him when he was found dead in Paris.",
      "Oliver Stone was very rough and abusive in his treatment of the actors during filming. Johnny Depp recalled he at one point he was so intimidated by Stone he nearly threw up",
      "The US Department of Defense declined to co-operate in the making of this film. Military equipment was loaned from the Armed Forces of the Phillippines",
      "Vietnam banned this film because of its depiction of the Vietnamese",
      "With this film, Oliver Stone became the first Vietnam veteran to direct a film about the war",
      "At one point, a character is warned not to drink from a river because he might get malaria. During filming, Willem Dafoe got thirsty and drank from the river not knowing a dead pig was upstream. He was sick with (not malaria) for a day"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/41-platoon-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/41-platoon/platoon-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/41-platoon/platoon-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/41-platoon/platoon-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/41-platoon/platoon-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/41-platoon/platoon-5.png"
    ],
    "headline": "CHARLIE SHEEN BEFORE THE (rampant) DRUGS",
    "comments": []
  },
  {
    "title": "The Intern",
    "film_id": 42,
    "director": "Nancy Meyers",
    "year": 2015,
    "runtime": "02:01",
    "genre": ["Comedy", "Drama", "Wholesome"],
    "writers": ["Nancy Meyers"],
    "cinematography": ["Stephen Goldblatt"],
    "soundtrack": ["Theodore Shapiro"],
    "notable_actors": ["Robert De Niro", "Anne Hathaway", "Rene Russo"],
    "blurb": "Seventy-year-old widower Ben Whittaker (Robert De Niro) has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin (Anne Hathaway).",
    "special_category": ["WHOLESOME", "DE NIRO-SCORSESE CONNECTION"],
    "tags": [
      "the",
      "intern",
      "comedy",
      "drama",
      "wholesome",
      "nancy",
      "meyers",
      "robert",
      "de niro",
      "anne",
      "hathaway",
      "rene",
      "russo",
      "2010"
    ],
    "trailer": "https://www.youtube.com/embed/ZU3Xban0Y6A",
    "trivia": [
      "Robert De Niro's daughter plays the hotel manager",
      "Reese Witherspoon was originally cast as Jules but dropped out",
      "Quentin Tarantino named this film as his favourite of 2015",
      "In the scene where Robert De Niro says he can tell all someone needs to know about him in 10 seconds, what he actually says takes about 13 seconds",
      "This was once set up at Paramount Pictures with Tina Fey starring"
    ],
    "review_text": "I’m not sure why I added this film to my watch list. It’s the only film that won’t alienate or make you jaded by life. In that sense it might just be the best film on my list. Starring my favourite Princess Diaries actress ANNIE HATHAWAY and the guy who has the most appearances on my blog, ROBERT DE NIRO, this movie’s just a plain grand old time that everyone should watch at least four times a year. That’s all I have to say about this wonder of world cinema.",
    "review_score": 7.5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/42-intern-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/42-intern/intern-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/42-intern/intern-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/42-intern/intern-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/42-intern/intern-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/42-intern/intern-5.jpg"
    ],
    "headline": "ANNIE HATHAWAY AKA PRINCESS THERMOPOLIS",
    "comments": []
  },
  {
    "title": "Blue Velvet",
    "film_id": 43,
    "director": "David Lynch",
    "year": 1986,
    "runtime": "02:00",
    "genre": ["Neo-Noir", "Mystery", "Thriller", "Surreal"],
    "writers": ["David Lynch"],
    "cinematography": ["Frederick Elmes"],
    "soundtrack": ["Angelo Badalamenti"],
    "notable_actors": [
      "Kyle MacLachlan",
      "Isabella Rossellini",
      "Dennis Hopper",
      "Laura Dern",
      "Hope Lange"
    ],
    "blurb": "The discovery of a severed human ear found in a field leads a young man (Kyle MacLachlan) on an investigation related to a beautiful, mysterious nightclub singer (Isabella Rossellini) and a group of psychopathic criminals who have kidnapped her child.",
    "special_category": ["LYNCHIAN"],
    "tags": [
      "blue",
      "velvet",
      "david",
      "lynch",
      "1980",
      "neo",
      "noir",
      "mystery",
      "thriller",
      "angelo",
      "badalamenti",
      "kyle",
      "maclachlan",
      "isabella",
      "rossellini",
      "dennis",
      "hopper",
      "laura",
      "dern",
      "hope",
      "lange"
    ],
    "trailer": "https://www.youtube.com/embed/lGQlJQHHTgA",
    "trivia": [
      "Dennis Hopper claimed David Lynch would never say the f-word, he would simply point to it and say 'that word'",
      "This film was the inspiration for Twin Peaks",
      "Molly Ringwald was originally offered the role of Sandy but her mother objected to the film due to its' graphic nature",
      "The second work where Dennis Hopper plays a guy named 'Frank' - he has seven unrelated roles as 'Frank' in his career",
      "Several of the actors who were considered for the role of Frank found the character too repulsive and intense. By contrast, Dennis Hopper is reported to have exclaimed 'I've got to play Frank because I am Frank!'"
    ],
    "review_text": "When I first watched this movie, I liked it. Second time around and about five years of incompetent life experiences later, I fucking hate this movie. I guess somewhere in the past five years I became disinterested in Lynchian portrayals of 1950s suburbia with obedient damsels and pale-skinned femme-fatale mysteries. It doesn’t help that the Kyle MacLachlan’s ‘Jefferey’ is less of a protagonist and more of a fucking pervert. I mean seriously, the whole reason the dude gets into the gigantic mess he does (spoiler) is because he sneaks into a woman’s apartment to fucking perve on her. Like dude seriously? Then he starts nailing this clearly mentally unstable, tortured woman and it’s like “bruh…”\nThat’s not even as bad as it gets. He starts seeing a HIGH SCHOOL SENIOR WHO’S ALREADY DATING SOME JOCK. Man does not care. Then he has the fucking gall to act all surprised when SURPRISE, the mentally unstable woman starts needing him and wanders naked and delirious to his house while he has the senior over talking shit like ‘he nutted in me and you’re basic’ – this movie’s more “the adventures of dumbass white boy” than it is surreal mystery.\nWhere the film does shine is in its exploration of sexual sadomasochism and dreamlike mise-en-scene. The performances of Dennis Hopper and his criminal associates while heavily over the top, are inspiring in their depictions as disgusting demons of the night. When this movie veers into surrealism, such as the vivid scene at Ben’s where multiple actions and behaviours occur simultaneously with the fluidity and unexpected execution of a stage performance, it veers like that country-redneck from Tokyo Drift.\nThis was still a pretty disappointing viewing, I probably wouldn’t watch it again.",
    "review_score": 3,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/43-velvet-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/43-blue_velvet/velvet-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/43-blue_velvet/velvet-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/43-blue_velvet/velvet-3.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/43-blue_velvet/velvet-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/43-blue_velvet/velvet-5.jpg"
    ],
    "headline": "AGENT COOP, YOU SICK FUCK",
    "comments": []
  },
  {
    "title": "True Romance",
    "film_id": 44,
    "director": "Tony Scott",
    "year": 1993,
    "runtime": "01:58",
    "genre": ["Romance", "Crime"],
    "writers": ["Quentin Tarantino"],
    "cinematography": ["Jeffrey L. Kimball"],
    "soundtrack": ["Hans Zimmer"],
    "notable_actors": [
      "Christian Slater",
      "Patricia Arquette",
      "Dennis Hopper",
      "James Gandolfini",
      "Gary Oldman",
      "Brad Pitt",
      "Christopher Walken",
      "Samuel L. Jackson"
    ],
    "blurb": "In Detroit, a lonely pop culture geek (Christian Slater) marries a call girl (Patricia Arquette), steals cocaine from her pimp (Gary Oldman), and tries to sell it in Hollywood. Meanwhile, the owners of the cocaine, the Mob, track them down in an attempt to reclaim it.",
    "special_category": ["TARNATINO IS A CREEP"],
    "tags": [
      "true",
      "romance",
      "1990",
      "tony",
      "scott",
      "romance",
      "crime",
      "quentin",
      "tarantino",
      "hans",
      "zimmer",
      "christian",
      "slater",
      "patricia",
      "arquette",
      "dennis",
      "hopper",
      "james",
      "gandolfini",
      "gary",
      "oldman",
      "brad",
      "pitt",
      "christopher",
      "walken",
      "samuel",
      "jackson",
      "drugs"
    ],
    "trailer": "https://www.youtube.com/embed/P6DW0HtpT-0",
    "trivia": [
      "James Gandolfini attained the role of Tony Soprano from his performance in this film",
      "Brad Pitt improvised most of his lines",
      "Copies of the original script sent out to studios had the tagline: 'When you're tired of relationships, try a romance'",
      "The motel room fight scene between Patricia Arquette and James Gandolfini took five days to shoot",
      "Director Tony Scott slapped Patricia Arquette on set (...with her consent)"
    ],
    "review_text": "A Quentin Tarantino written feature heavily sprinkled with cocaine should be a lot more concise and entertaining than what it was. While the acting performances by Christian Slater and Patricia Arquette are fantastic in their portrayals of unlikeable coke-addled thieves, a lot of the dialogue and characterisation is exaggerated, cringeworthy and clearly written by the Tarantula’s overblown ego. This dude pisses me off with how much he loves his own dialogue, it’s like a non self-aware Aaron Sorkin.\nAnyway, while the film is beautifully shot and scored, the script is boring and stilted. The only real reason this film was on my list is because it features a slightly younger and infinitely thinner James Gandolfini as the mob enforcer ‘Virgil’. I fucking love James Gandolfini and his performance as Tony Soprano and so it was harrowing seeing the now deceased actor before Sopranos fame. It was this role that landed him the role of Tony, and you can certainly see why.\nAll in all, this movie sucks with the exception of the acting performances; they really did the best they could do with a shitty Tarantino script. The costume and artistic department should be commended for their excellence use of colour and props for the bright, Miami influenced set.",
    "review_score": 2,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/44-true_romance-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/44-true_romance/true_romance-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/44-true_romance/true_romance-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/44-true_romance/true_romance-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/44-true_romance/true_romance-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/44-true_romance/true_romance-5.jpg"
    ],
    "headline": "IF YOUR IDEA OF ROMANCE IS AN OUNCE OF COCAINE AND NEVERENDING PARANOIA",
    "comments": []
  },
  {
    "title": "Mad Max 2",
    "film_id": 45,
    "director": "George Miller",
    "year": 1981,
    "runtime": "01:36",
    "genre": ["Action"],
    "writers": ["Terry Hayes", "George Miller", "Brian Hannant"],
    "cinematography": ["Dean Semler"],
    "soundtrack": ["Brian May"],
    "notable_actors": ["Mel Gibson"],
    "blurb": "In the post-apocalyptic Australian wasteland, a cynical drifter (Mel Gibson) agrees to help a small, gasoline-rich community escape a horde of bandits.",
    "special_category": ["FUCK AUSTRALIA", "DYSTOPIC SCI-FI"],
    "tags": [
      "mad",
      "max",
      "2",
      "1980",
      "action",
      "george",
      "miller",
      "brian",
      "may",
      "mel",
      "gibson",
      "australia"
    ],
    "trailer": "https://www.youtube.com/embed/UlwtiOyaoo0",
    "trivia": [
      "Mel Gibson only has 16 lines of dialogue throughout the film",
      "Because he was relatively unknown in the US at the time, the US trailer featured action and car chase sequences instead of Mel Gibson",
      "Was shot in sequence",
      "James Cameron cited this as one of his influences behind 'The Terminator'",
      "One of the factors determining the location was the prediction of rainfall charts - but it ended up raining during the shoot (for the first time in over four years)"
    ],
    "review_text": "Dude so first and foremost, I hate Australia and cannot for the LIFE OF ME stand the Australian accent. That being said, George Miller is one talented dude. Following the events of the first Mad Max, famous anti-semite Mel Gibson speeds through the Australian wasteland as a lone merc accompanied by a cattle dog. The post-apocalyptic Australian desert is sparsely populated by gangs, bandits and as Max discovers, a surviving township / civilisation.\nI toughed out my extreme dislike for Australia and their residents to watch this movie and although I feel I’ve betrayed my morals, it resulted in a satisfying and thrilling journey through what I assume will be Australia in five to ten years (depending on whether or not they keep electing Scott Morrison).\nOil is the main commodity of society following total global collapse as the supply of oil is practically depleted. The rabid wasteland is infested with surviving marauders that Max must ultimately evade to escort the settlers of the township Far North (apparently the Sunshine Coast in Queensland). This journey and development of Max as a gritty, lone wolf merc to gritty, lone wolf merc with some heart isn’t exactly riveting, but the circumstances of the world and stakes at hand are compelling enough to accentuate the action to produce a fantastic, easy-watch film. ",
    "review_score": 6,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/45-max-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/45-mm2/max-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/45-mm2/max-2.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/45-mm2/max-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/45-mm2/max-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/45-mm2/max-5.jpg"
    ],
    "headline": "MEL GIBSON HATES JEWS",
    "comments": []
  },
  {
    "title": "Nightcrawler",
    "film_id": 46,
    "director": "Dan Gilroy",
    "year": 2014,
    "runtime": "01:57",
    "genre": ["Crime", "Drama", "Thriller"],
    "writers": ["Dan Gilroy"],
    "cinematography": ["Robert Elswit"],
    "soundtrack": ["James Newton Howard"],
    "notable_actors": [
      "Jake Gyllenhaal",
      "Rene Russo",
      "Riz Ahmed",
      "Bill Paxton"
    ],
    "blurb": "When Louis Bloom, a con man desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story",
    "special_category": [""],
    "tags": [
      "nightcrawler",
      "dan",
      "gilroy",
      "2010",
      "crime",
      "drama",
      "thriller",
      "robert",
      "elswit",
      "james",
      "newton",
      "howard",
      "jake",
      "gyllenhaal",
      "rene",
      "russo",
      "riz",
      "ahmed",
      "bill",
      "paxton"
    ],
    "trailer": "https://www.youtube.com/embed/DtWaDylmDRo",
    "trivia": [
      "Jake Gyllenhaal lost ~10kg for this role",
      "Jake Gyllenhaal and Riz Ahmed rode along with real nightcrawlers in Los Angeles to prepare for their roles",
      "To create Lou's gaunt appearance, Jake Gyllenhaal worked out for up to 8 hours a day and ran or cycled to set everyday",
      "Dan Gilroy considered a backstory to explain Lou's amoral and damaged character but ultimately cut it entirely in order to not spend too much time on Lou or make him sympathetic",
      "During the scene Lou screams into a mirror, Gyllenhaal actually broke his hand on the mirror on set",
      "Filmed over 28 nights"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/46-nightcrawler-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/46-nightcrawler/nightcrawler-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/46-nightcrawler/nightcrawler-2.jpeg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/46-nightcrawler/nightcrawler-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/46-nightcrawler/nightcrawler-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/46-nightcrawler/nightcrawler-5.jpg"
    ],
    "headline": "CREEPY GYLLENHAAL",
    "comments": []
  },
  {
    "title": "Twelve Monkeys",
    "film_id": 47,
    "director": "Terry Gilliam",
    "year": 1995,
    "runtime": "02:09",
    "genre": ["Science Fiction"],
    "writers": ["David Peoples", "Janet Peoples", "Chris Marker"],
    "cinematography": ["Roger Pratt"],
    "soundtrack": ["Paul Buckmaster"],
    "notable_actors": [
      "Bruce Willis",
      "Madeleine Stowe",
      "Brad Pitt",
      "Christopher Plummer"
    ],
    "blurb": "In a future world devastated by disease, a convict (Bruce Willis) is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.",
    "special_category": ["DYSTOPIC SCI-FI"],
    "tags": [
      "twelve",
      "monkeys",
      "terry",
      "gilliam",
      "1990",
      "sci-fi",
      "science fiction",
      "david",
      "peoples",
      "janet",
      "chris",
      "marker",
      "roger",
      "pratt",
      "paul",
      "buckmaster",
      "bruce",
      "willis",
      "madeleine",
      "stowe",
      "brad",
      "pitt",
      "christopher",
      "plummer",
      "future",
      "12"
    ],
    "trailer": "https://www.youtube.com/embed/wuggl3cZD8A",
    "trivia": [
      "Terry Gilliam was afraid that Brad Pitt wouldn't be able to pull off the nervous, rapid speech. He enlisted a speech coach but in the end just took away his cigarettes. Pitt played the part perfectly to Gilliams request",
      "Terry Gilliam gave Bruce Willis a list of his acting cliches not to be used in the film, including the 'steely blue eyes look'",
      "Bruce Willis took a lower salary for this film mostly because of budget restrictions, but also because he wanted to work with Terry Gilliam",
      "The script and some promotional material reveal the film takes place in 2035",
      "Brad Pitt signed onto the movie when he was a relatively low-profile name and thus had a vastly lower salary. By the release time, Pitt was one Hollywood's leading actors due to 'Interview with the Vampire', 'Legends of the Fall' and 'Seven' ",
      "Many of the actors took a pay cut just to work with Terry Gilliam"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/47-monkeys-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/47-twelve_monkeys/monkeys-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/47-twelve_monkeys/monkeys-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/47-twelve_monkeys/monkeys-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/47-twelve_monkeys/monkeys-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/47-twelve_monkeys/monkeys-5.jpg"
    ],
    "headline": "I WAS PROMISED 12 MONKEYS AND GOT NONE",
    "comments": []
  },
  {
    "title": "Das Boot",
    "film_id": 48,
    "director": "Wolfgang Peterson",
    "year": 1981,
    "runtime": "02:29",
    "genre": ["War"],
    "writers": ["Wolfgang Peterson"],
    "cinematography": ["Jost Vacano"],
    "soundtrack": ["Klaus Doldinger"],
    "notable_actors": [
      "Jurgen Prochnow",
      "Herbert Gronemeyer",
      "Klaus Wennemann"
    ],
    "blurb": "The claustrophobic world a WWII German U-boat; boredom, filth and sheer-terror.",
    "special_category": ["GERMAN"],
    "tags": [
      "das",
      "boot",
      "wolfgang",
      "peterson",
      "jost",
      "vacano",
      "klaus",
      "doldinger",
      "jurgen",
      "prochnow",
      "herbert",
      "gronemeyer",
      "klaus",
      "wennemann",
      "1980",
      "german",
      "foreign"
    ],
    "trailer": "https://www.youtube.com/embed/sBI0WMJSi8k",
    "trivia": [
      "The bulk of the films' USD$15M budget was spent on constructing U-Boats",
      "The cast was deliberately kept indoors continually during the shooting period in order to look pale as a real submarine crew would on a mission at sea",
      "The submarine models were also used in 'Raiders of the Lost Ark'",
      "Scenes were shot in sequence so that the growth of beards would be entirely natural, although a few shots had to be redone with false hair",
      "In the scene in the La Rochelle bar, Otto Sander was really drunk"
    ],
    "review_text": "I’ll admit I had a difficult time trying to tell all these Aryan whites in their uniforms apart - but mostly got a handle on it through their surnames.\nAdditionally, Netflix only had the director’s cut version and I couldn’t be fucked pirating the theatrical release – which led me to sleeping through most of this film because it was so fucking long and I’m not sure I really gave a shit. I PROMISE THIS IS THE ONLY MOVIE I DID SO.\nProbably doesn’t help this was the first film I watched on this review-spree, really set the tone for the rest of the reviews.\nBut from what I gather through Wikipedia and random episodic memories of the viewing, the film focused on the perspective of a German U-Boat crew in the midst of the Second World War. This was intriguing to me because of the lack of Nazi perspectives in my knowledge-base, but I soon grew to realise this was a mostly West-German (AMERICA) production that held strong anti-Nazi views. I mean, this is ideal but in terms of experiencing and trying to fully understand the mindset of a racist-ass Nazi crew, I was certainly disappointed. There was character development for sure, I recall the construction of the Lieutenant journalist to be particularly basic in his ‘fish-out-the-water’ soldier story but to be fair, I can’t honestly say shit because I was errantly snoozing the whole time.\nWhile I was enthused in the film (the first hour or so), I found the inclusion of a battle-hardened older veteran protagonist far too admirable for a Nazi, you know what I mean? It helped that he (along with several other introduced elders) expressed an alienation and a sense of bitter resentment towards the Fuhrer and seemed broken enough to illicit such feeling.\nAfter falling asleep and missing the actual film, I decided to read several reviews (as well as the plot) on Wikipedia and saw that the original author of the book the film is based on felt it was over-dramatised and many actors over-acted. When viewed from that perspective, the Hollywood score, extreme close ups on facial emotions and purposely cut frames become obvious in their west German funding influence. That being said, who doesn’t enjoy a little West German influence in their day-to-day life (praise President Ronald Reagan).\nOverall I’ll most likely rewatch the director’s cut because I enjoyed the tense, claustrophobic environment of the boat. Similarly, we were exposed to a seemingly straight-laced German whose brain I’d actually like to pick. I also watched this film about three hours before I found out there was a COVID-19 outbreak in Auckland so that may have fragmented my memory somewhat.\nI give this film 2.5 stars out of 5 – THAT’S RIGHT I FEEL LIKE IF A MOVIE LEADS ME TO SLEEP IT’S NOT WORTHY OF A DECENT RATING.\n[This whole blog has been an attempt to pander to right-wing audiences who enjoy German culture and phrases like “heil Hitler”]",
    "review_score": 5,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/48-das_boot-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/48-das_boot/das_boot-1.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/48-das_boot/das_boot-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/48-das_boot/das_boot-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/48-das_boot/das_boot-4.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/48-das_boot/das_boot-5.jpg"
    ],
    "headline": "WHAT?? STONER VIDEO CLERK, YOU DON'T KNOW THE STORY OF DIE KRANKENSCHWESTER UND DER AUGENBLICK??",
    "comments": []
  },
  {
    "title": "Escape from New York",
    "film_id": 49,
    "director": "John Carpenter",
    "year": 1981,
    "runtime": "01:39",
    "genre": ["Action", "Adventure", "Science Fiction"],
    "writers": ["John Carpenter", "Nick Castle"],
    "cinematography": ["Dean Cundey"],
    "soundtrack": ["John Carpenter", "Alan Howarth"],
    "notable_actors": [
      "Kurt Russell",
      "Lee Van Cleef",
      "Ernest Borgnine",
      "Isaac Hayes",
      "Harry Dean Stanton"
    ],
    "blurb": "In 1997, when the US president crashes into Manhattan, now a giant maximum security prison, a convicted bank robber is sent in to rescue him",
    "special_category": ["80S ACTION"],
    "tags": [
      "escape",
      "from",
      "new",
      "york",
      "john",
      "carpenter",
      "1980",
      "action",
      "adventure",
      "sci-fi",
      "science fiction",
      "nick",
      "castle",
      "kurt",
      "russell",
      "1997",
      "president"
    ],
    "trailer": "https://www.youtube.com/embed/ckvDo2JHB7o",
    "trivia": [
      "Kurt Russell stated this was his favourite of his own films, with Snake Plissken being his favourite character",
      "The model of the set was re-painted and re-used for 'Blade Runner'",
      "Cyberpunk pioneer William Gibson credits this film as an influence on his novel, 'Neuromancer'",
      "Kurt Russell decided to wear the eye patch at the last second before shooting and did not tell Carpenter before hand - who liked the look so they kept it",
      "The role of the president was pitched to Donald Pleasence as the 'love child between Ronald Reagan and Margeret Thatcher'",
      "Carpenter managed to persuade the city of St. Louis to shut off the electricity for ten blocks at night for shooting",
      "Carpenter originally wrote the film between 1974 and 1976 as a reaction to the Watergate scandal but studios found it too dark and violent for the time - this changed after the success of 'Halloween'"
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/49-escape-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/49-escape/escape-1.png",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/49-escape/escape-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/49-escape/escape-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/49-escape/escape-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/49-escape/escape-5.jpg"
    ],
    "headline": "SNAKE PLISSKIN",
    "comments": []
  },
  {
    "title": "Inherent Vice",
    "film_id": 50,
    "director": "Paul Thomas Anderson",
    "year": 2014,
    "runtime": "02:28",
    "genre": ["Comedy", "Crime", "Drama"],
    "writers": ["Paul Thomas Anderson"],
    "cinematography": ["Robert Elswit"],
    "soundtrack": ["Jonny Greenwood"],
    "notable_actors": [
      "Joaquin Phoenix",
      "Josh Brolin",
      "Owen Wilson",
      "Katherine Waterston",
      "Reese Witherspoon",
      "Benicio del Toro",
      "Jena Malone",
      "Joanna Newsom"
    ],
    "blurb": "In 1970, drug-fueled Los Angeles private investigator Larry 'Doc' Sportello investigates the disappearance of a former girlfriend.",
    "special_category": [""],
    "tags": [
      "inherent",
      "vice",
      "paul",
      "thomas",
      "anderson",
      "comedy",
      "crime",
      "drama",
      "2010",
      "robert",
      "elswit",
      "jonny",
      "greenwood",
      "joaquin",
      "phoenix",
      "josh",
      "brolin",
      "owen",
      "wilson",
      "katherine",
      "waterston",
      "reese",
      "witherspoon",
      "benicio",
      "del",
      "toro",
      "jena",
      "malone",
      "joanna",
      "newsom"
    ],
    "trailer": "https://www.youtube.com/embed/wZfs22E7JmI",
    "trivia": [
      "Reese Witherspoon filmed all of her scenes in four days",
      "Robert Downey Jr. was originally attached in the lead role but Joaquin Phoenix ended up taking the role because PTA wanted to work with him again (after 'Walk the Line')",
      "An adaptation of the Thomas Pynchon novel, who gave his blessing to PTA upon reading the script",
      "To celebrate the premiere of the film, the famous Alamo Drafthouse theatre in Denver, CO (where cannabis is legal), organised a party bus tour where attendees were encouraged to smoke as much cannabis as they wanted. PTA was present but did not partake.",
      "PTA reportedly went about adapting the book by typing it up word for word, then proceeding from there.",
      "Thomas Pynchon (the writer of the novel this film is adapted from) makes a cameo appearance.",
      "The screenplay is notable for being drastically different from the finished film, containing more information and scenes."
    ],
    "review_text": "",
    "review_score": 0,
    "thumbnail": "https://film-img.s3.ap-southeast-2.amazonaws.com/thumbnails/50-inherent_vice-thumb.png",
    "img_bank": [
      "https://film-img.s3.ap-southeast-2.amazonaws.com/50-inherent_vice/inherent_vice-2.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/50-inherent_vice/inherent_vice-3.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/50-inherent_vice/inherent_vice-4.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/50-inherent_vice/inherent_vice-5.jpg",
      "https://film-img.s3.ap-southeast-2.amazonaws.com/50-inherent_vice/inherent_vice-6.jpg"
    ],
    "headline": "",
    "comments": []
  }
]
